%201500127 Δημήτρης Ορεινός Εργασία 4


%Ορίζουμε αρχικά τα αντίστοιχα διανύσματα χρόνου για το κάθένα,
%που θα τα ονομάσουμε n_h και n_x αντίστοιχα για τα σήματα h[n] και x[n].Για να ορίσουμε τα διανύσματα
%χρόνου που αντιστοιχούν σε κάθε σήμα χρησιμοποιούμε τη τεχνική των
%πολύκλαδων συναρτήσεων.

%Το σήμα h[n] ορίζεται στο χρόνο n. Για παράδειγμα, για το σήμα  h[n], 
%ένας κλάδος μπορεί να ορίζεται ως n_h1, ενώ ο ολικός χρόνος ως n_h,μέσω της σύντμησης των
%διανυσμάτων χρόνου(που έχουν μία μόνο σειρά) του σημάτος h[n] , σε ενιαίο διανύσμα χρόνου.
%Αντίστοιχα  το σήμα  x[n] ορίζεται στο χρόνο n,
%ένας κλάδος μπορεί να ορίζεται ως n_x1, ενώ ο ολικός χρόνος ως n_x,μέσω τη σύντμησης  
%διανυσμάτων χρόνου του σημάτος x[n], σε ενιαίο διανύσμα χρόνου.
%(Οι συντμήσεις των διανυσμα΄των χρόνου θα γίνουν παρακάτω).



n_h1=[-10:-3];

n_h2=[-2:3];

n_h3=[4:10];



n_x1=[-10:-1];

n_x2=[0:5];

n_x3=[6:10];




%Έπειτα με τη βοήθεια των συναρτήσεων zeros και ones, ορίζουμε τα δύο σήματα
%h[n] και x[n] σε ένα κοινό διάστημα του χρόνου n.Χρησιμοποιούμε για αυτό το
%σκοπό και την εντολή length(vector) που επιστρέφει το μήκος του εκάστοτε
%διανύσματος χρόνου που χρειαζόμαστε.


b_1=length(n_h1);

h_1=zeros(1,b_1);


b_2=length(n_h2);

h_2=ones(1,b_2);


b_3=length(n_h3);

h_3=zeros(1,b_3);



b_4=length(n_x1);

x_1=zeros(1,b_4);




b_5=length(n_x2);

x_2=n_x2+1;



b_6=length(n_x3);

x_3=zeros(1,b_6);




n_x=[n_x1  n_x2  n_x3];

n_h=[n_h1  n_h2  n_h3];

%Πραγματοποιούμε όπως και με τα διανύσματα χρόνου πιο πάνω, μία αντίστοιχη σύντμηση
%των διανυσμάτων των τιμών(που έχουν μία μόνο σειρά) των σημάτων h[n] και
%x[n].

x=[x_1 x_2 x_3]; 

h=[h_1 h_2 h_3];

%Ύστερα με τη χρήση της συνάρτησης y=conv(x,h)*time_step, όπου time_step=1,
%άρα y=conv(x,h), υπολογίζουμε τη συνέλιξη μεταξύ των δύο σημάτων h[n] και
%x[n].
%(Βέβαια θα μπορούσαμε να ορίσουμε τα διανύσματα χρόνου n_h και n_h και για τα δύο σήματα h[n] και x[n], 
%μόνο στα διαστήματα εκείνα στα οποία το καθένα ξεχωριστά παίρνει μη
%μηδενικές τιμές(χρησιμοποιώντας όμως τη συνάρτηση ones).
%Παρόλο που και με αυτό το τρόπο θα προκύψουν σωστά αποτελέσματα, 
%καθώς όμως η άσκηση μας ζητά να χρησιμοποιήσουμε τις
%συναρτήσεις zeros  και ones, είναι προτιμότερη η τεχνική των πολύκλαδων
%συναρτήσεων).
y=conv(x,h);

t=[-20:20];


subplot(3,1,1)


stem(n_h,h,'o')%Σχεδιάζουμε στο δεύτερο  παράθυρο το σήμα x[n],
%χρησιμοποιώντας την εντολή stem(x,y),όπου σαν ανεξάρτητη μεταβλητή x,θα θεωρήσουμε το χρόνο n και σαν
%εξαρτημένη μεταβλητή y, τις τιμές του σήματος h[n], για κάθε τιμή του
%χρόνου n.

grid

ylabel('h[n]'), xlabel('n'), legend('h[n]'), title('h[n]') %Μετά με τη χρήση των εντολών 
%ylabel('text'), xlabel('text'), legend('text'), title('text'), 
%εισάγουμε κατάλληλους τίτλους αξόνων και γραφήματος, λεζάντα, πλέγμα και
%βαθμολόγηση αξόνων για τo γράφημα του σήματος h[n].


subplot(3,1,2)

stem(n_x,x,'dr')%Σχεδιάζουμε στο δεύτερο  παράθυρο το σήμα x[n],
%χρησιμοποιώντας την εντολή stem(x,y),όπου σαν ανεξάρτητη μεταβλητή x,θα θεωρήσουμε το χρόνο n και σαν
%εξαρτημένη μεταβλητή y, τις τιμές του σήματος x[n], για κάθε τιμή του
%χρόνου n.

grid

ylabel('x[n]'), xlabel('n'), legend('x[n]'), title('x[n]')%Μετά με τη χρήση των εντολών 
%ylabel('text'), xlabel('text'), legend('text'), title('text'), 
%εισάγουμε κατάλληλους τίτλους αξόνων και γραφήματος, λεζάντα, πλέγμα και
%βαθμολόγηση αξόνων για τo γράφημα του σήματος x[n].


subplot(3,1,3)


stem(t,y,'g')%Σχεδιάζουμε στο τρίτο παράθυρο το σήμα y[n] που είναι το σήμα συνέλιξης μεταξύ των σημάτων h[n] 
%και x[n],χρησιμοποιώντας την εντολή stem(x,y),όπου σαν ανεξάρτητη μεταβλητή x,θα θεωρήσουμε το χρόνο n και σαν
%εξαρτημένη μεταβλητή y, τις τιμές του σήματος y[n], για κάθε τιμή του
%χρόνου n.

grid

ylabel('y[n]'), xlabel('n'), legend('y[n]=h[n]*x[n]'), title('y[n]')%Με τη χρήση των εντολών 
%ylabel('text'), xlabel('text'), legend('text'), title('text'), 
%εισάγουμε κατάλληλους τίτλους αξόνων και γραφήματος, λεζάντα, πλέγμα και
%βαθμολόγηση αξόνων για τo γράφημα του σήματος y[n].






