%201500127 Δημήτρης Ορεινός Εργασία 2


%Αρχικά ορίζουμε το διακριτό σήμα x[n]=3*exp[(-0.2+0.5*j*n)], με το διάνυσμα χρόνου n(στο διακριτό χρόνο n) να
%ορίζεται ως εξής:n=[-20,-19,-18,-17,.......,0,.......17,18,19,20].

n=[-20:20];


X=3*exp((-0.2+0.5*j)*n);

%Ύστερα χρησιμοποιούμε τις εντολές real(complex_number), imag(complex_number), abs(complex_number) και 
%angle(complex_number),για να υπολογίσουμε το πραγματικό μέρος, το φανταστικό μέρος, το μέτρο και τη φάση του, 
%αντίστοιχα.

x1=real(X);

x2=imag(X);

x3=abs(X);

x4=angle(X);


%Ανοίγουμε νέο παράθυρο σχεδίασης, μέσω της εντολής subplot(m,n,p), όπου ο δείκτης p δείχνει ποιο παράθυρο 
%είναι ανοιχτό και το χωρίζουμε  σε 4 μέρη.   

subplot(4,1,1)

stem(n,x1,'dr')%Στο πρώτο παράθυρο σχεδιάζουμε το μέγεθος του πραγματικού μέρους του διακριτού σήματος x[n],
%ως συνάρτηση του χρόνου.


ylabel('Re(x[n])'), xlabel('n'), legend('Re(x[n])'), title('Re(x[n])')%Μετά με τη χρήση των εντολών 
%ylabel('text'), xlabel('text'), legend('text'), title('text'), 
%εισάγουμε κατάλληλους τίτλους αξόνων και γραφήματος, λεζάντα, πλέγμα και
%βαθμολόγηση αξόνων για τo γράφημα του πραγματικού μέρους του  διακριτού σήματος x[n] Im(x[n]).




subplot(4,1,2)

stem(n,x2,'db')%Στο δεύτερο παράθυρο σχεδιάζουμε το μέγεθος του φανταστικού μέρους του διακριτού σήματος x[n],
%ως συνάρτηση του χρόνου.

ylabel('Im(x[n])'), xlabel('n'), legend('Im(x[n])'), title('Im(x[n])')%Μετά με τη χρήση των εντολών 
%ylabel('text'), xlabel('text'), legend('text'), title('text'), 
%εισάγουμε κατάλληλους τίτλους αξόνων και γραφήματος, λεζάντα, πλέγμα και
%βαθμολόγηση αξόνων για τo γράφημα του φανταστικού μέρους του  διακριτού σήματος x[n] Im(x[n]).

%Το περιοδικό σήμα x[n]=3*exp[(-0.2+0.5*j)*n)], μέσω του τύπου του Euler
%exp(j*φ)=cos(φ)+j*sin(φ),όπου η γωνία φ να ανήκει στο διάστημα[0,2*π],μπορεί να γραφτεί στη μορφή
%x[n]=3*exp(-0.2*n)*(cos(0.5*n)+j*sin(0.5*n)), άρα προκύπτει ότι το
%πραγαμτικό μέρος ορίζεται ως Re(x[n])=3*exp(-0.2*n)*cos(0.5*n) και
%το φανταστικό μέρος ορίζεται ως Im(x[n])=3*j*exp(-0.2*n)*sin(0.5*n).
%’ρα το πραγματικό μέρος Re(x[n]) και το φανταστικό μέρος Im(x[n])αποτελούν
%δύο ημιτονοειδείς όρους cos(0.5*n)(της μορφής cos(ω*n+θ), με θ=0, για λόγους ευκολίας) και sin(0.5*n)
%(της μορφής sin(ω*n+θ), με θ=0, για λόγους ευκολίας), αντίστοιχα, οι οποίοι
%είναι πολλαπλασιασμένοι με έναν εκθετικό όρο 3*exp(-r*n).Επειδή
%r=-0.2<0, θα μείνεται ο εκθετικός όρος με τη πάροδο του χρόνου n, άρα θα μείωνονται
%αντίστοιχα και τα πλάτη των ημιτονοειδών όρων και έτσι και το πραγματικό
%και το φανταστικό μέρος του διακριτού σήματος σε συνάρτηση με το χρόνο n.

subplot(4,1,3)

stem(n,x3,'p')%Στο τρίτο παράθυρο σχεδιάζουμε το μέγεθος του μέτρου του διακριτού σήματος x[n],
%ως συνάρτηση του χρόνου.

ylabel('|x[n]|'), xlabel('n'), legend('|x[n]|'), title('|x[n]|')%Μετά με τη χρήση των εντολών 
%ylabel('text'), xlabel('text'), legend('text'), title('text'), 
%εισάγουμε κατάλληλους τίτλους αξόνων και γραφήματος, λεζάντα, πλέγμα και
%βαθμολόγηση αξόνων για τo γράφημα του μέτρου του  διακριτού σήματος x[n] |x[n]|.

%Έχουμε πει προηγουμένως ότι το πραγαμτικό μέρος ορίζεται ως Re(x[n])=3*exp(-0.2*n)*cos(0.5*n) και
%το φανταστικό μέρος ορίζεται ως Im(x[n])=3*j*exp(-0.2*n)*sin(0.5*n). Το μέτρο ενός μιγαδικού διακριτού 
%σήματος δίνεται από τη σχέση
%|x[n]|=((Re(x[n]))^(2)+(Im(x[n]))^(2))^(1/2).
%|x[n]|=((3*j*exp(-0.2*n))^(2)*((cos(0.5*n))^(2)+(sin(0.5*n))^(2)))^(1/2),
%και επειδή (cos(0.5*n))^(2)+(sin(0.5*n))^(2)=1, για κάθε γωνία φ που ανήκει στο διάστημα [0,2*π],
%τότε |x[n]|=|3*j*exp(-0.2*n)|=3*j*exp(-0.2*n). Επειδή όπως είδαμε ότι το μέτρο
%ενός εκθετικού αριθμού είναι ίσο με τον ίδιο τον εκθετικό, τότε το μέτρο
%του διακριτού σήματος x[n], θα ακολουθεί τις ίδιες μεταβολές που
%παρουσιάζει ο εκθετικός όρος 3*j*exp(-0.2*n).



subplot(4,1,4)

stem(n,x4,'o')%Στο τέταρτο παράθυρο σχεδιάζουμε το μέγεθος της φάσης του διακριτού σήματος x[n],
%ως συνάρτηση του χρόνου.

ylabel('φ(x[n])'), xlabel('n'), legend('φ(x[n])'), title('φ(x[n])')%Μετά με τη χρήση των εντολών 
%ylabel('text'), xlabel('text'), legend('text'), title('text'), 
%εισάγουμε κατάλληλους τίτλους αξόνων και γραφήματος, λεζάντα, πλέγμα και
%βαθμολόγηση αξόνων για τo γράφημα της φάσης του διακριτού σήματος x[n] φ(x[n]).

%Όσον αφορά τη γραφική παράσταση της φάσης συναρτήσει του χρόνου η μορφή
%που παίρνει οφείλεται στο γεγονός ότι ισχύει η σχέση για τη γωνία φ,
%tan(φ)=Im(x[n])/Re(x[n])ή φ=atan(Im(x[n])/Re(x[n]))(αντίστροφη εφαπτομένη).

%Σε κάθε μία από τις παραπάνω γραφικές παραστάσεις, έχουμε θεωρήσει, για
%λόγους ευκολίας,ότι η αρχική φάση θ=0.
