%201500127 Δημήτρης Ορεινός Εργασία 3
%Ορίζουμε αρχικά τα αντίστοιχα διανύσματα χρόνου για το κάθένα,
%που θα τα ονομάσουμε t_h και t_x αντίστοιχα για τα σήματα h(t) και x(t). Τα διανύσματα χρόνου t_h και t_x 
%τα ορίζουμε στο κοινό διάστημα [0:0.1:7], όπου το χρονικό βήμα time_step είναι σταθερό και ίσο με 0.1,
%χρησιμοποιώντας τη τεχνική των πολύκλαδων συναρτήσεων.

%Το σήμα h(t) ορίζεται στο χρόνο t. Για παράδειγμα, για το σήμα  h(t), 
%ένας κλάδος μπορεί να ορίζεται ως n_h1, ενώ ο ολικός χρόνος ως n_h,μέσω της σύντμησης των
%διανυσμάτων χρόνου(που έχουν μία μόνο σειρά) του σημάτος h(t) , ορίζεται σε ενιαίο διανύσμα χρόνου.
%Αντίστοιχα  το σήμα  x(t) ορίζεται στο χρόνο t,
%ένας κλάδος μπορεί να ορίζεται ως t_x1, ενώ ο ολικός χρόνος ως t_x,μέσω τη σύντμησης  
%διανυσμάτων χρόνου του σημάτος x(t), σε ενιαίο διανύσμα χρόνου.
%(Οι συντμήσεις των διανυσμάτων του χρόνου θα γίνουν παρακάτω).


t_x1=[0:0.1:0.9];

t_x2=[1:0.1:5];

t_x3=[5.1:0.1:7];


t_h1=[0:0.1:0.9];

t_h2=[1:0.1:3];

t_h3=[3.1:0.1:7];

%Έπειτα με τη βοήθεια των συναρτήσεων zeros και ones, ορίζουμε τα δύο σήματα
%h(t) και x(t) στο κοινό διάστημα του χρόνου t, που προαναφέραμε.Χρησιμοποιούμε για αυτό το
%σκοπό και την εντολή length(vector) που επιστρέφει το μήκος του εκάστοτε
%διανύσματος χρόνου που χρειαζόμαστε.
b_1=length(t_h1);

h_1=zeros(1,b_1);


b_2=length(t_h2);

h_2=exp(-(t_h2-1));


b_3=length(t_h3);

h_3=zeros(1,b_3);



b_4=length(t_x1);

x_1=zeros(1,b_4);




b_5=length(t_x2);

x_2=ones(1,b_5);



b_6=length(t_x3);

x_3=zeros(1,b_6);



t_x=[t_x1  t_x2  t_x3];

t_h=[t_h1  t_h2  t_h3];

%Πραγματοποιούμε όπως και με τα διανύσματα χρόνου πιο πάνω, μία αντίστοιχη σύντμηση
%των διανυσμάτων των τιμών(που έχουν μία μόνο σειρά) των σημάτων h(t) και
%x(t).
x=[x_1 x_2 x_3];

h=[h_1 h_2 h_3];

y=conv(x,h)*0.1;%Ύστερα με τη χρήση της συνάρτησης y=conv(x,h)*time_step, όπου το χρονικό βήμα time_step=0.1,
%άρα y=conv(x,h)*0.1, υπολογίζουμε τη συνέλιξη μεταξύ των δύο σημάτων h(t) και
%x(t).

t_y=[min(t_h)+min(t_x):0.1:max(t_h)+max(t_x)]; %Επειδή για τα μήκη των τριών σημάτων x, h ,y ισχύει: 
%length(y) = length(x) + length(h)  1, τότε κάνοντας χρήση των συναρτήσεων min και max, διαπιστώνουμε ότι ο
%χρόνος που ορίζεται η πράξη της συνέλιξης θα είναι ο t_y=[min(t_h)+min(t_x):0.1:max(t_h)+max(t_x)]
%’ρα, επειδή τα δύο σήματα έχουν οριστεί στο ίδιο διάστημα
%[t_min:time_step:t_max]=[0:0.1:0.7],με το χρονικό βήμα time_step να είναι σταθερό και
%ίσο με 0.1, η y θα ορίζεται στο διάστημα [2*t_min:time_step2*t_max]=[0:0.1:14]. 

 
subplot(3,1,1)

plot(t_h,h,'r')%Σχεδιάζουμε στο πρώτο παράθυρο το σήμα h(t),
%χρησιμοποιώντας την εντολή plot(x,y),όπου σαν ανεξάρτητη μεταβλητή x,θα θεωρήσουμε το χρόνο t και σαν
%εξαρτημένη μεταβλητή y, τις τιμές του σήματος h(t), για κάθε τιμή του
%χρόνου t.

ylabel('h(t)'), xlabel('t'), legend('h(t)'), title('h(t)')%Με τη χρήση των εντολών 
%ylabel('text'), xlabel('text'), legend('text'), title('text'), 
%εισάγουμε κατάλληλους τίτλους αξόνων και γραφήματος, λεζάντα, πλέγμα και
%βαθμολόγηση αξόνων για τo γράφημα του σήματος h(t).




subplot(3,1,2)

plot(t_x,x,'g')%Σχεδιάζουμε στο δεύτερο παράθυρο το σήμα x(t),
%χρησιμοποιώντας την εντολή plot(x,y),όπου σαν ανεξάρτητη μεταβλητή x,θα θεωρήσουμε το χρόνο t και σαν
%εξαρτημένη μεταβλητή y, τις τιμές του σήματος x(t), για κάθε τιμή του
%χρόνου t.

ylabel('x(t)'), xlabel('t'), legend('x(t)'), title('x(t)')%Με τη χρήση των εντολών 
%ylabel('text'), xlabel('text'), legend('text'), title('text'), 
%εισάγουμε κατάλληλους τίτλους αξόνων και γραφήματος, λεζάντα, πλέγμα και
%βαθμολόγηση αξόνων για τo γράφημα του σήματος x(t).







subplot(3,1,3)


plot(t_y,y,'db')%Σχεδιάζουμε στο τρίτο παράθυρο το σήμα y(t) που είναι το σήμα συνέλιξης μεταξύ των σημάτων h(t) 
%και x(t),χρησιμοποιώντας την εντολή stem(x,y),όπου σαν ανεξάρτητη μεταβλητή x,θα θεωρήσουμε το χρόνο t και σαν
%εξαρτημένη μεταβλητή y, τις τιμές του σήματος y(t), για κάθε τιμή του
%χρόνου t.

ylabel('y(t)'), xlabel('t'), legend('y(t)=h(t)*x(t)'), title('y(t)=h(t)*x(t)')%Με τη χρήση των εντολών 
%ylabel('text'), xlabel('text'), legend('text'), title('text'), 
%εισάγουμε κατάλληλους τίτλους αξόνων και γραφήματος, λεζάντα, πλέγμα και
%βαθμολόγηση αξόνων για τo γράφημα του σήματος y(t).






