%201500127 Δημήτρης Ορεινός ’σκηση 2.1


%Αρχικά ορίζουμε το σήμα συνεχούς χρόνου x(t) που μας δίνεται από την εκφωνηση της άσκησης,
%χρησιμοποιώντας τη τεχνική των πολύκλαδων συναρτήσεων και ορίζοντας
%σταθερό χρονικό βήμα time_step=0.1. Πιο συγκεκριμένα το σήμα x(t) ορίζεται
%ως εξής:
%x(t)=t, με το t να ανήκει στο διάστημα [0,1]

%x(t)=2-t, με το t να ανήκει στο διάστημα (1,2]

clc
clear all

t1=[0:0.01:1];

t2=[1.01:0.01:2];

%Πραγματοποιούμε   μία  σύντμηση
%των διανυσμάτων των τιμών, αλλά και των διανύσματων χρόνου,(που έχουν μία μόνο σειρά),όσον αφορά το σήμα
%x(t).%Σε αυτήν την άσκηση όταν θα αναφερόμαστε στο χρόνο ή στο σήμα x(t) θα μιλάμε για τα 
%διανύσματα χρόνου t1 και t2 ή στα διανύσματα τιμών x1 και x2,αντίστοιχα, που έχουν
%συντμηθεί.

x1=t1;

x2=2-t2;


t=[t1 t2];

x=[x1 x2];


%Έπειτα μέσω της εντολής figure ανίογουμε ένα νέο παράθυρο σχεδίασης. 

figure

subplot(3,1,1)%Με τη χρήση  της εντολής subplot(m,n,p), (όπου ο τελευταίος δείκτης p
%ορίζει ποιο παράθυρο κάθε φορά είναι ανοιχτό),χωρίζουμε το παράθυρο σχεδίασης σε τρία μέρη. 


 
 plot(t,x)%Σχεδιάζουμε στο πρώτο παράθυρο το σήμα x(t),χρησιμοποιώντας την εντολή plot(x,y),
%όπου σαν ανεξάρτητη μεταβλητή x,θα θεωρήσουμε το χρόνο t(σύντμηση δοανυσμάτων χρόνου) και σαν
%εξαρτημένη μεταβλητή y, τις τιμές του σήματος f(t), για κάθε τιμή του
%χρόνου t.Το συγκεκριμένο σήμα θα το σχεδιάσουμε για μία περίοδο Τ0,όπου  T0=2.
 
grid  

ylabel('x(t)'), xlabel('t'), legend('x(t)'), title('x(t)')%Μετά με τη χρήση των εντολών ylabel('text')
%, xlabel('text'), legend('text'), title('text'), 
%εισάγουμε κατάλληλους τίτλους αξόνων και γραφήματος, λεζάντα, πλέγμα και
%βαθμολόγηση αξόνων για to γράφημα του σήματος x(t)




for v=-20:20
   
   
    c_k(v+21)=0.5*trapz(t,x.*exp(-j*v*pi*t));%Για τον υπολογισμό του ολοκληρώματος που μας δίνει 
%τους συντελεστές Fourier του σήματος x(t)την εντολή
%trapz(X,Y), όπου Χ θεωρούμε τη μεταβλητή ως προς την οποία ολοκληρώνουμε,
%δηλαδή το μέγεθος τoυ χρόνου t και Υ το μέγεθος το οποίο ολοκληρώνουμε,
%δηλαδή το γινόμενο του μέτρου του σήματος x(t), με τον εκθετικό όρο exp(-j*k*2*π/T0*t)=exp(-j*k*π*t).
    
end

k=[-20:20];%Ορίζουμε ένα διάνυσμα k






subplot(3,1,2)

stem(k,c_k)%Σχεδιάζουμε στο δεύτερο παράθυρο το σήμα x(t),χρησιμοποιώντας την εντολή stem(x,y),
%όπου σαν ανεξάρτητη μεταβλητή x,θα θεωρήσουμε τον αριθμό k πού μέσω αυτού
%χωρίζουμε το φάσμα του σήματος σε ακέραια πολλαπλάσια της θεμελειώδους συχνότητας και σαν
%εξαρτημένη μεταβλητή y, τις τιμές των συντελεστών Fourier του συνεχούς σήματος x(t), 
%για κάθε τιμή του k.

grid

ylabel('Ck'), xlabel('k'), legend('Ck'), title('Ck')%Μετά με τη χρήση των εντολών ylabel('text')
%, xlabel('text'), legend('text'), title('text'), 
%εισάγουμε κατάλληλους τίτλους αξόνων και γραφήματος, λεζάντα, πλέγμα και
%βαθμολόγηση αξόνων για τo γράφημα των συντελεστών Fourier Ck του σήματος x(t).

xx=0;
for k=-20:20
    
    
    xx=xx+c_k(k+21)*exp(j*k*pi*t);%Υπολογίζουμε  το αθροίσμα που μας δίνει 
%το σήμα x(t) μέσω του γινομένου των συντελεστων Fourier του σήματος x(t)
%με τον εκθετικό όρο exp(j*k*π*t)
    
    
end


subplot(3,1,3)

plot(t,xx)%Σχεδιάζουμε στο τρίτο παράθυρο το σήμα x(t),χρησιμοποιώντας την εντολή plot(x,y),
%όπου σαν ανεξάρτητη μεταβλητή x,θα θεωρήσουμε το χρόνο t(σύντμηση διανυσμάτων χρόνου) και σαν
%εξαρτημένη μεταβλητή y, τις τιμές του σήματος x(t)(σύντμηση διανυσμάτων x1 και x2), για κάθε τιμή του
%χρόνου t.Το συγκεκριμένο σήμα θα το σχεδιάσουμε για μία περίοδο Τ0,όπου  T0=2.
 

grid

ylabel('xrec(t)'), xlabel('t'), legend('xrec(t)'), title('xrec(t)')%Μετά με τη χρήση των εντολών ylabel('text')
%, xlabel('text'), legend('text'), title('text'), 
%εισάγουμε κατάλληλους τίτλους αξόνων και γραφήματος, λεζάντα, πλέγμα και
%βαθμολόγηση αξόνων για τo γράφημα του ανακατασκευασμένου σήματος x(t) μέσω
%των συντελεστών Fourier Ck.

%Τελικά από το παραπάνω διάγραμμα και γνωρίζοντας ότι οι συντελεστές
%Fourier Ck του σήματος x(t),με το ίδιο το σήμα x(t) συνδέεονται μέσω του
%γνωστού αθροίσματος που υπάρχει και στη σελίδα 14 του εργαστηριακού
%οδηγού, καταλήγουμε στο συμπέρασμα ότι το αρχικό σήμα μέσω
%των συντελεστών Fourier Ck μπορεί να ανακατασκευαστεί πλήρως και με μεγάλη
%ακρίβεια.


