%201500127 Δημήτρης Ορεινός

clc
clear all

%Αρχικά ορίζουμε το σήμα πληροφορίας m(t),χρησιμοποιώντας τη τεχνική των πολύκλαδων συναρτήσεων,
%όπου ορίζουμε τα κατάλληλα κάθε φορά διανύσματα χρόνου, όλα με σταθερό χρονικό βήμα ts=0,0005sec. %
%Το σήμα m(t)ορίζεται ως εξής:m(t)=1 ,για t που ανήκει στο χρονικό διάστημα(ορισμένο ως 
%χρονικό διάνυσμα t1) [0,t0/3],m(t)=-2 ,για t που ανήκει στο χρονικό διάστημα(ορισμένο ως 
%χρονικό διάνυσμα t2) (t0/3,2*t0/3],m(t)=0 ,για t που ανήκει στο χρονικό διάστημα(ορισμένο ως 
%χρονικό διάνυσμα t3) (2*t0/3,t0].
%Ορίζουμε ως σταθερές του προβλήματος τη χρονική σταθερά t0=0,15sec, το 
%χρονικό βήμα(Περίοδος Δειγματοληψίας)ts=0,001sec, τη συχνότητα
%δειγματοληψίας fs=1/ts, το συχνοτικό βήμα df=0,25 Hz, τη σταθερά Kf που
%εκφράζει την ευαισθησία συχνότητας που μετράται σε μονάδες Ηz/Volt
%Kf=50 Ηz/Volt και τη συχνότητα του φορέα fc=200Ηz. Ταυτόχρονα ορίζουμε  και το σήμα του
%φ ορέα, όπου c(t) =Αc*cos(2*π*fc*t), με Αc=1, το πλάτος του φέροντος κύματος.


t0=0.15;
ts=0.0005;
fc=200;
kf=50;
fs=1/ts;

df=0.25;



t1=[0:ts:t0/3];

t2=[(t0/3)+ts:ts:2*t0/3];

t3=[(2*t0/3)+ts:ts:t0];


t=[t1 t2 t3];%Ορίζουμε το χρόνο t σαν ένα διάνυσμα χρόνου που έχει προκύψει 
%από σύντμηση των τριών διανυσμάτων χρόνου t1, t2, t3.



m1=ones(1,length(t1));

m2=-2*ones(1,length(t2));

m3=zeros(1,length(t3));

m=[m1 m2 m3];%Κάνουμε σύντημση των διανυσμάτων τιμών του σήματος m(t) για να προκύψει το σήμα πληροφορίας m(t).

c=cos(2*pi*fc*t);
%Ύστερα αφού ορίσαμε τα συνεχή σήματα πληροφορίας m(t) και φορέα c(t), θα
%ορίσουμε το διαμορφωμένο σήμα κατα συχνότητα (FM) uFM(t). Το σήμα uFM(t)
%ορίζεται για φορέα c(t)=Αc*cos(2*π*fc*t), όπου fc η συχνότητα του φορέα της μορφής από τη σχέση
%uFM(t)=Ac*cos(θ(t)), όπου θ(t) η γωνία του διαμορφωμένου σήματος και
%ισχύει ότι θ(t)=2*π*fc*t+φ(t), όπου φ(t) η φάση του διαμορφωμένου σήματος,
%που είναι συνάρτηση του σήματος πληροφορίας m(t)  και έτσι θα ορίσουμε
%την ανάλογη στο ρυθμό μεταβολής της φάσης στιγμιαία συχνότητα
%fi(t)=(1/2*π)*d(θ(t))/dt=fc+(1/2*π)*d(φ(t))/dt. Για το συγκεκριμένο σήμα η φ(t) θα δίνεται από τη σχέση:
%φ(t)=2*π*Kf*v(t)=100*π*v(t), όπου v(t) το ολοκλήρωμα του σήματος m(t) από το -άπειρο(στη πραγματικότητα από το μηδέν,
%διότι τα σήμα  m(t)έχει οριστεί στο διάστημα [0,t0])στη
%μεταβλητή t, το οποίο υπολογίζουμε με τη χρήση μιας forloop που φαίνεται
%στις παρακάτω γραμμές κώδικα. Τελικά fi(t)=50*π*d(v(t))/dt+fc=50*π*m(t)+fc.


int_m(1)=0;
for(i=1:length(t)-1)
int_m(i+1)=int_m(i)+m(i)*ts;
end


u=cos(2*pi*fc*t + 2*pi*kf*int_m);%Με βάση όλα τα παραπάνω η τελική έκφραση για 
%uFM(t)=cos(2*π*200*t + 2*π*50*v)=cos(400*π*t)*cos(100*π*v)-sin(400*π*t)*sin(100*π*v),διότι ισχύει η
%τριγωνομετρική ταυτότητα cos(a+b)=cos(a)*cos(b)-sin(a)*sin(b), με a,b να
%ανήκουν στο διάστημα γωνιών [0,2*π]. 





figure(1);%Μέσω της εντολής figure ανοίγουμε ένα νέο παράθυρο σχεδίασης που το χωρίζουμε σε τρία μέρη.


subplot(3,1,1);

plot(t,m(1:length(t)));%Στο πρώτο παράθυρο σχεδιάζουμε τη γραφική παράσταση του σήματος m(t) 
%σε συνάρτηση με το χρόνο t,
%χρησιμοποιώντας την εντολή plot(x,y),
%όπου σαν ανεξάρτητη μεταβλητή x,θα θεωρήσουμε το χρόνο t(το
%διάνυσμα χρόνου t)και σαν εξαρτημένη μεταβλητή y, τις τιμές του 
%του σήματος m(t) ,για κάθε τιμή του χρόνου t(διάνυσμα χρόνου t).


axis([0,0.15,-2.1,2.1]);%Ορίζουμε τα όρια του άξονα του χρόνου(τον θεωρούμε ως άξονα x, 
%αλλά και του άξονα των τιμών του σήματος m(t)(τον θεωρούμε ως άξονα y) 
%στη γραφική παράσταση του σήματος πληροφορίας m(t), μέσω της εντολής
%axis(xmin,xmax,ymin,ymax).

xlabel('t'),ylabel('m(t)'), legend('m(t)'), title('m(t)')%Με τη χρήση των εντολών ylabel('text')
%, xlabel('text'), legend('text'), title('text'), 
%εισάγουμε κατάλληλους τίτλους αξόνων και γραφήματος, λεζάντα, πλέγμα και
%βαθμολόγηση αξόνων για τo γράφημα  του σήματος πληροφορίας m(t).



grid


pause(0);




subplot(3,1,2);
plot(t,c(1:length(t)));%Στο δεύτερο παράθυρο σχεδιάζουμε τη γραφική παράσταση του σήματος φορέα c(t) 
%σε συνάρτηση με το χρόνο t,
%χρησιμοποιώντας την εντολή plot(x,y),
%όπου σαν ανεξάρτητη μεταβλητή x,θα θεωρήσουμε το χρόνο t(το
%διάνυσμα χρόνου t)και σαν εξαρτημένη μεταβλητή y, τις τιμές του 
%του σήματος του φορέα c(t) , για κάθε τιμή του χρόνου t(διάνυσμα χρόνου t).

axis([0,0.15,-2.1,2.1]);%Ορίζουμε τα όρια του άξονα του χρόνου(τον θεωρούμε ως άξονα x, 
%αλλά και του άξονα των τιμών του σήματος c(t)(τον θεωρούμε ως άξονα y) 
%στη γραφική παράσταση του σήματος του φορέα c(t), μέσω της εντολής
%axis(xmin,xmax,ymin,ymax).



xlabel('t'),ylabel('c(t)'), legend('c(t)'), title('c(t)')%Με τη χρήση των εντολών ylabel('text')
%, xlabel('text'), legend('text'), title('text'), 
%εισάγουμε κατάλληλους τίτλους αξόνων και γραφήματος, λεζάντα, πλέγμα και
%βαθμολόγηση αξόνων για τo γράφημα  του σήματος  φορέα c(t).

grid

pause(0);


subplot(3,1,3);
plot(t,u(1:length(t)));%Στο τρίτο παράθυρο σχεδιάζουμε τη γραφική παράσταση 
%του διαμορφωμένου σήματος κατα συχνότητα uFM(t) 
%σε συνάρτηση με το χρόνο t,
%χρησιμοποιώντας την εντολή plot(x,y),
%όπου σαν ανεξάρτητη μεταβλητή x,θα θεωρήσουμε το χρόνο t(το
%διάνυσμα χρόνου t)και σαν εξαρτημένη μεταβλητή y, τις τιμές του 
%του σήματος uFM(t), για κάθε τιμή του χρόνου t(διάνυσμα χρόνου t).


axis([0,0.15,-2.1,2.1]);%Ορίζουμε τα όρια του αξόνα του χρόνου(τον θεωρούμε ως άξονα x), 
%αλλά και του άξονα των τιμών του σήματος uFM(t)(τον θεωρούμε ως άξονα y) 
%στη γραφική παράσταση του διαμορφωμένου κατά συχνότητα σήματος uFM(t), μέσω της εντολής
%axis(xmin,xmax,ymin,ymax).



xlabel('t'),ylabel('u(t)'), legend('u(t)'), title('u(t)')%Με τη χρήση των εντολών ylabel('text')
%, xlabel('text'), legend('text'), title('text'), 
%εισάγουμε κατάλληλους τίτλους αξόνων και γραφήματος, λεζάντα, πλέγμα και
%βαθμολόγηση αξόνων για τo γράφημα του  διαμορφωμένου κατά συχνότητα σήματος uFΜ(t).


grid

pause(0);
%Επίσης από όλα τα παραπάνω που ορίσαμε αλλά και από τις γραφικές παραστάσεις που  
%κατασκευάσαμε συμπεραίνουμε αυτή η διαμόρφωση 
%μπορεί να θεωρηθεί ως σαν διαμόρφωση πλάτους(AM) 
%δύο ορθογώνιων φερόντων-συνιστωσών cos(400*π*t) και sin(400*π*t), όπου η
%συμφασική συνιστώσα είναι η xI(t)=cos(400*π*t) και η ορθογώνια συνιστώσα
%είναι η xQ(t)=sin(400*π*t), με την περιβάλλουσα V(t) του διαμορφωμένου σήματος
%να είναι ανεξάρτητη από το χρόνο, διότι V(t)=(xI(t)^2+xQ(t)^2)^(1/2)=Ac.
%Τα δύο ορθογώνια φέροντα διαμορφώνονται μέσω των δύο μη γραμμικών όρων
%cos(400*π*t) και sin(400*π*t), κάτι που καθιστά την διαμόρφωση γωνίας(άρα
%και τη διαμόρφωση της συχνότητας) ως μια μη γραμμική διδικασία, που δεν
%ισχύει η αρχή της υπέρθεσης.


figure(2)%Μέσω της εντολής figure ανοίγουμε ένα νέο παράθυρο σχεδίασης.

plot(t,int_m(1:length(t)));%Σχεδιάζουμε τη γραφική παράσταση 
%του  σήματος v(t) 
%σε συνάρτηση με το χρόνο t,
%χρησιμοποιώντας την εντολή plot(x,y),
%όπου σαν ανεξάρτητη μεταβλητή x,θα θεωρήσουμε το χρόνο t(το
%διάνυσμα χρόνου t)και σαν εξαρτημένη μεταβλητή y, τις τιμές του 
%του σήματος v(t), για κάθε τιμή του χρόνου t(διάνυσμα χρόνου t).


axis([0,0.15,-0.06,0.06]);%Ορίζουμε τα όρια του άξονα του χρόνου(τον θεωρούμε ως άξονα x, 
%αλλά και του άξονα των τιμών του σήματος c(t)(τον θεωρούμε ως άξονα y) 
%στη γραφική παράσταση του σήματος v(t), μέσω της εντολής
%axis(xmin,xmax,ymin,ymax).

title('v(t)') , xlabel('t'), ylabel('v(t)'), legend('v(t)')%Με τη χρήση των εντολών ylabel('text')
%, xlabel('text'), legend('text'), title('text'), 
%εισάγουμε κατάλληλους τίτλους αξόνων και γραφήματος, λεζάντα, πλέγμα και
%βαθμολόγηση αξόνων για τo γράφημα  του σήματος v(t).

grid

%Με τη χρήση της βοηθητικής συνάρτησης [M,m,df]=fftseq(m,ts,df) και
%παράλληλα από τον γνωστό ορισμό του μετασχηματισμού Fourier 
%για τα συνεχή σήματα, δηλαδή το ολοκλήρωμα από το 0 εώς το t0(Όλα τα
%σήματα m(t), c(t) και uAM(t) τα ορίσαμε στο διάστημα [0,t0]) γινομένου του εκάστοτε σήματος με
%τον εκθετικό όρο e^(-j*2*π*f*t).Η παραπάνω αναλυτική μέθοδος 
% για το διαμορφωμένο κατά συχνότητα σήμα uFM(t), έχει τέτοιο βαθμό
%δυσκολίας που ουσιαστικά δεν είναι εφικτή η πραγματοποίησή της.Έτσι παρακάτω θα παρουσιαστεί περιγραφικά 
%ένας προσεγγιστικός τρόπος της εύρεσης του μετσχηματισμού Fourier του σήματος uFM(t), χρησιμοποιώντας το ανάπτυγμα Taylor. 
%Για τα σήματα m(t) και c(t) υπολογίζουμε αναλυτικά μέσω του γνωστού ορισμού του μετασχηmaτισμού Fourier 
%,αλλά και μέσω των παρακάτω γραμμών κώδικα τους μετασχηματισμούς
%Fourier των σημάτων αυτών.
%Τελικά θα προκύψει το ίδιο
%αποτέλεσμα και με τους δύο τρόπους για τα δύο αυτά σήματα, δηλαδή: 

%M(j*2*π*f)=(t0/3)*e^(-j*π*f*t0/3)*sinc(t0*f/3)-2*(t0/3)*e^(-j*π*f*t0)*sinc(t0*f/3),
%όπου  για t0=0,15sec, θα έχουμε ότι
%Μ(j*2*π*f)=(0,05)*(1-2*e^(-0,1*π*f))*e^(-j*π*0,05*f)*sinc(0,05*f).

%Για συχνότητα φορέα fc=200Hz

%C(j*2*π*f)=0,5*(δ(f+200)+δ(f-200)), δηλαδή το άθροισμα δύο συναρτήσεων δέλτα που
%προσεγγίζονται από στενούς παλμούς,με τη συγκεκριμένη συνάρτηση, να
%"ακουμπάει"(δηλαδή να αρχίσει και να σταματήσει να παίρνει τιμές) τόσο η θετική, όσο και η
%αρνητική συχνοτική συνιστώσα της, στη συχνότητες |f|=200Hz και |f|=300Hz .
%Αυτή η συνάρτηση(θετική και αρνητική συχνοτική συνιστώσα) θα πάρει τη μέγιστη τιμή της 
%που είναι ίση με 0,5, για |fc|=200Hz.Στο διάγραμμα όμως που προκύπτει από
%τη matlab, η μέγιστη τιμή είναι μικρότερη του 0,5, διότι έχουμε δαιρέσει
%το μετασχηματισμό Fourier fs=1/ts=1/0,0005=2000 Hz.Αυτή η μεγάλη συχνότητα
%δειγματοληψίας μας εξασφαλίζει μεγαλύτερη ακρίβεια στην αναπαράσταση του
%σήματος.

% UFM(j*2*π*f)=(Ac/2)*[F[cos(φ(t)](για(f-fc))+F[cos(φ(t)](για(f+fc))+j*F[sin(φ(t)](για(f-fc))]
%-0,5*j*F[sin(φ(t)](για(f+fc)) ,επειδή όμως για το συγκεκριμένο σήμα είναι δύσκολο να βρεθεί ακριβής έκφραση 
%για το μετασχηματισμό Fourier, προσεγγίζουμε τους όρους cos(φ(t))και sin(φ(t)) του σήματος uFM(t), 
%μέσω του αναπτύγματος Taylor,δηλαδή cos(φ(t))=1-φ(t)^2/2!+φ(t)^4/4! 
%και sin(φ(t))=φ(t)-φ(t)^3/3!+φ(t)^5/5!.Τελικά η συνάρτηση uFM(t)για πλάτος Ac=1 θα γίνει:
% uFM(t)=cos(400*π*t)-((100*π*v(t))^2/2!)*cos(400*π*t)+((100*π*v(t))^4/4!)*cos(400*π*t)+cos(400*π*t)-((100*π*v(t))^3/3!)*cos(400*π*t)+
%((100*π*v(t))^5/5!)*cos(400*π*t)-.......(Το σήμα φ(t) έχει μετασχηματισμό Fourier
%Φ(j*2*π*f)).
%και επίσης, χρησιμοποιώντας την ιδιότητα της Διαμόρφωσης του Μετασχηματισμού Fourier με φ(t)=100*π*v(t)  θα ισχύει ότι:
% η UFM(j*2*π*f) έχει αθρόισματα από συναρτήσεις δέλτα και Φ(j*2*π*f), αλλά
%και διαφορές συναρτήσεων Φ(j*2*π*f).

%Με ανάλογη λογική μπορούμε,προσεγγιστικά πάντα,να βγάλουμε αντίστοιχες σχέσεις και
%συμπεράσματα,εκφράζοντας το σήμα m(t) με συχνότητα fm σαν άθροισμα συνημιτόνων και έπειτα χρησιμοποιώντας 
%τις συναρτήσεις Bessel  με όρισμα τον δείκτη διαμόρφωσης βf=β,όπου δεν ισχύει ότι βf<<1, και τάξης n
%(βf και n πραγματικοί αριθμοί)που έχει τις εξής ιδίότητες:
%1)Jn(β) είναι πραγματική συνάρτηση, 2)J-n(β)=(-1)^n*Jn(β)και 3)άθροισμα από το -άπειρο
%στο +΄άπειρο των όρων (Jn(b))^2 να ισούται με 1.

%Προκύπτουν τα ακόλουθα αυμπεράσματα:

%1) Το φάσμα του σήματος FM αποτελείται από ένα άπειρο πλήθος
%φασματικών συνιστωσών, μια από τις οποίες αντιστοιχεί στο
%φορέα (συχνότητα fc) και άπειρες πλευρικές φασματικές
%συνιστώσες στις συχνότητες fc± n*fm (n = 1,2,...)
%2)Το πλάτος των φασματικών συνιστωσών εξαρτάται από τις τιμές της
%συνάρτησης Jn(β).
%3)Το πλάτος της φασματικής συνιστώσας του φορέα είναι J0(β), ενώ το
%πλάτος της φc± nφm φασματικής συνιστώσας είναι Jn(β).
%4)Από τους σχετικούς πίνακες για τη συνάρτηση Bessel γίνεται φανερό ότι όσο αυξάνεται το n
%(δηλαδή η τάξη της αντίστοιχης αρμονικής), τόσο η Jn(β) (δηλαδή το
%μέγεθος των αντίστοιχων αρμονικών) μειώνεται.
%5)Πρακτικά οι υψηλής τάξης αρμονικές μπορούν να θεωρηθούν
%αμελητέες, με την έννοια ότι το σύνολο της ισχύος του σήματος FM
%είναι συγκεντρωμένο σε πεπερασμένο εύρος συχνοτήτων, που
%εξαρτάται από την παράμετρο β.


[M,m,df1]=fftseq(m,ts,df);

M=M/fs;

f=[0:df1:df1*(length(m)-1)]-fs/2;%Ορίζουμε κατάλληλο "κεντραρισμένο διάστημα συχνοτήτων στο 0, ώστε αργότερα 
%να σχεδιάσουμε τα φάσματα των σημάτων m(t),c(t) και uFΜ(t).





[C,c,df1] = fftseq(c,ts,df);

C=C/fs;


[U,u,df1]=fftseq(u,ts,df);

U=U/fs;

%Επίσης από τον υπολογισμό του μετασχηματισμού Fourier γα το διαμορφωμένο
%σήμα uFM(t),προκύπτουν τα εξής συμπεράσματα:
%1)Το εύρος ζώνης του σήματος είναι ίσο με W, άρα το εύρος ζώνης των
%σημάτων φ(t)^n είναι ίσο με n*W. ’ρα το φάσμα του διαμορφωμένου σήματος
%κατά συχνότητα(FM) δεν είναι περιορισμένο, αλλά εκτείνεται από το -άπειρο
%στο +άπειρο, διότι και το n μπορεί να λάβει άπειρες τιμές.’ρα το εύρος
%ζώνης του σήματος είναι άπειρο.
%2) Tο φάσμα του διαμορφωμένου σήματος αποτελείται από το φάσμα του
%φέροντος κύματος, αλλά και από τα αντίστοιχα φάσματα των φ(t)^n, με
%κέντρο τη συχνότητα fc, όπου όσο μεγαλώνει η δύναμη n των σημάτων φ(t)^n
%τόσο το φασματικό πλάτος μειώνεται, επομένως αναφερόμαστε σε φασματικό
%περιεχόμενο, το οποίο βρίσκεται σε ολοένα και μεγαλύτερη απόσταση από τη
%συχνότητα fc, κάτι που φαίνεται και από τη μέιωση που παρουσιάζουν οι μη
%γραμμικοί όροι cos(φ(t))και sin(φ(t)), αναπτυσσομενοι κατά Taylor.
%3)Για μη περιοδικά σήματα ο υπολογισμός του εύρους του φάσματος, που καταλαμβάνει το σήμα πληροφορίας m(t), 
%είναι μία διαδικασία η οποία εξαρτάται άμεσα από το ποσοστό της ποσότητας
%πληροφορίας του σήματος πληροφορίας που ενδιαφέρει να περικλείει το διαμορφωμένο σήμα.


%Ύστερα θα υπολογίσουμε  τον δείκτη διαμόρφωσης FM από την εξίσωση βf=kf*α/W,που ισχύει για ημιτονοειδή σήματα πληροφορίας 
%θέτοντας α=max|m(t)| ώστε να υποστηρίζει σήματα πληροφορίας που δεν έχουν ημιτονοειδή μορφή, 
%όπως το σήμα m(t) που μας δώθηκε στην εκφώνηση της άσκησης. Επίσης W=fmax,
%δηλαδή επειδή το σήμα m(t) που μας δίνεται έχει θεωρητικά άπειρο φάσμα,
%όπως καταλήξαμε και προηγουμένως μέσω του μετασχηματισμού
%Fourier,ουσιαστικά θα επιλέξουμε μια μέγιστη συχνότητα μέσω της οποίας θα υπολογιστεί 
%το εύρος ζώνης του σήματος πληροφορίας.Ο δείκτης διαμόρφωσης εκφράζει 
%τη μέγιστη απόκλιση της στιγμιαίας συχνότητας του διαμορφωμένου σήματος uFM(t) fi(t) από τη συχνότητα του φορέα fc, 
%κανονικοποιημένη ως προς το εύρος ζώνης W. Θεωρoύμε στη συγκεκριμένη
%περίπτωση ότι W=fmax=20 Hz. Επειδή ο δείκτης διαμόρφωσης βf που
%προκύπτει,μέσω του προγράμματος σε matlab,ισούται με 5, άρα δεν ισχύει ότι βf<<1, τότε στην σχέση για το σήμα uFM(t), 
%οι όροι ανώτερης τάξης δεν μπορούν να αγνοηθούν και θα έχουμε διαμόρφωση συχνότητας
%ευρείας ζώνης(WBFM).
%Όμως πέρα από τα παραπάνω μας ενδιαφέρει και το ενεργό εύρος ζώνης το
%οποίο περιέχει ένα μεγάλο μέρος της ισχύος του διαμορφωμένου σήματος, σε
%ποσοστό μεγαλύτερο από 99%. Tο ενεργό εύρος ζώνης μπορεί να προσεγγιστεί με μεγάλη ακρίβεια, 
%χρησιμοποιώντας τονκανόνα του Carson ο οποίος διατυπώνεται ως εξής:
%BT=2*W*(βf+1)=240 Hz. Οι παρακάτω γραμμές κώδικα συμπίπτουν ακριβώς με το
%θεωρητικό υπολογισμό που κάνουμε για το ενεργό εύρος ζώνης, συνεπώς τα
%αποτελέσματα των θεωρητικών υπολογισμών αλλά και των υπολογισμών στη
%matlab είναι ακριβώς τα ίδια. Όσον αφορά την ισχύ του σήματος uFM(t),όπου
%ισχύει ότι το ολοκλήρωμα από το 0 στο t0 της συνάρτησης uFM(t)^2 PFM=Ac^2/2=1/2,
%αυτή λόγω σταθερού πλάτους του σήματος uFM(t),θα
%είναι σταθερή, που σημαίνει ότι χωρίς να μεταβάλλεται η τιμή της
%ανακατανέμεται σε όλες τις συνιστώσες του φάσματος, δηλαδή στις 
%πλευρικές ζώνες του φάσματος.

%Επίσης αν θεωρούσαμε ότι το εύρος ζώνης είναι: 1)W=200 Hz ή ότι 2)W=2000Hz, τότε για
%τον δείκτη διαμόρφωσης βf και για το ενεργό εύρος ζώνης ΒT ισχύει
%ότι:1)βf=0,5 και ΒΤ=600Ηz και 1)βf=0,05 και ΒΤ=4200Ηz=4,2kHz. Τελικά
%συμπεραίνουμε ότι όσο αυξάνουμε το εύρος ζώνης W, τόσο μειώνεται ο δείκτης
%διαμόρφωσης βf, άρα και η μέγιστη απόκλιση της στιγμιαίας συχνότητας του διαμορφωμένου σήματος uFM(t) 
%fi(t) από τη συχνότητα του φορέα fc, δηλαδή ο όρος max(fi(t)-fc)=max((1/2*π)*d(φ(t))/dt)=50*π*max(m(t)).
% Επίσης θα παρατηρηθεί αύξηση του ενεργού εύρος ζώνης, δηλαδή το μεγάλο μέρος της ισχύος του διαμορφωμένου σήματος, σε
%ποσοστό μεγαλύτερο από 99%, που περιέχει θα είναι το ίδιο και περισσότερο "απλωμένο" στο φάσμα του σήματος uFM(t). 
W=20;

bf=kf*max(abs(m))/W;

BT=(bf+1)*2*W;





print -dbitmap modfm2a;
pause(0);




figure(3)%Μέσω της εντολής figure ανοίγουμε ένα νέο παράθυρο σχεδίασης που το χωρίζουμε σε τρία μέρη.

subplot(3,1,1);

plot(f,abs(fftshift(M)));%Στο πρώτο παράθυρο σχεδιάζουμε τη γραφική παράσταση του σήματος του φορέα
%c(t) σε συνάρτηση με τη συχνότητα f ,
%χρησιμοποιώντας την εντολή plot(x,y),
%όπου σαν ανεξάρτητη μεταβλητή x,θα θεωρήσουμε τη συχνότητα f("κεντραρισμένο" διάνυσμα συχνοτήτων f στο μηδέν)
%και σαν εξαρτημένη μεταβλητή y, τις τιμές του 
%του σήματος πληροφορίας m(t) ,για κάθε τιμή της συχνότητας f("κεντραρισμένο" διάνυσμα συχνοτήτων f στο μηδέν)


title('M(j*2*π*f)') , xlabel('f'), ylabel('M(j*2*π*f)'), legend('M(j*2*π*f)')
%Με τη χρήση των εντολών ylabel('text')
%, xlabel('text'), legend('text'), title('text'), 
%εισάγουμε κατάλληλους τίτλους αξόνων και γραφήματος, λεζάντα, πλέγμα και
%βαθμολόγηση αξόνων για τo φάσμα του μέτρου του "κεντραρισμένου" στο μηδέν
%Μετασχηματισμού Fourier FFT του σήματος πληροφορίας m(t).


grid

subplot(3,1,2);



plot(f,abs(fftshift(C)));%Στο δεύτερο παράθυρο σχεδιάζουμε τη γραφική παράσταση του σήματος του φορέα
%c(t) σε συνάρτηση με τη συχνότητα f ,
%χρησιμοποιώντας την εντολή plot(x,y),
%όπου σαν ανεξάρτητη μεταβλητή x,θα θεωρήσουμε τη συχνότητα f("κεντραρισμένο" διάνυσμα συχνοτήτων f στο μηδέν)
%και σαν εξαρτημένη μεταβλητή y, τις τιμές του του μέτρου του "κεντραρισμένου" στο μηδέν
%Μετασχηματισμού Fourier FFT
%του σήματος του φορέα c(t) ,για κάθε τιμή της συχνότητας f("κεντραρισμένο"
%διάνυσμα συχνοτήτων f στο μηδέν).


title('C(j*2*π*f)') , xlabel('f'), ylabel('C(j*2*π*f)'), legend('C(j*2*π*f)')
%Με τη χρήση των εντολών ylabel('text')
%, xlabel('text'), legend('text'), title('text'), 
%εισάγουμε κατάλληλους τίτλους αξόνων και γραφήματος, λεζάντα, πλέγμα και
%βαθμολόγηση αξόνων για τo γράφημα του μέτρου του "κεντραρισμένου"
%Μετασχηματισμού Fourier FFT του σήματος του φορέα c(t).


grid

subplot(3,1,3);


plot(f,abs(fftshift(U)));%Στο τρίτο παράθυρο σχεδιάζουμε τη γραφική παράσταση του διαμορφωμένου κατα συχνότητα σήματος(FM)
%uFM(t) σε συνάρτηση με τη συχνότητα f ,
%χρησιμοποιώντας την εντολή plot(x,y),
%όπου σαν ανεξάρτητη μεταβλητή x,θα θεωρήσουμε τη συχνότητα f("κεντραρισμένο" διάνυσμα συχνοτήτων f στο μηδέν)
%και σαν εξαρτημένη μεταβλητή y, τις τιμές του του μέτρου του "κεντραρισμένου" στο μηδέν
%Μετασχηματισμού Fourier FFT
%του σήματος uFM(t) ,για κάθε τιμή της συχνότητας f("κεντραρισμένο"
%διάνυσμα συχνοτήτων f στο μηδέν).


title('UFM(j*2*π*f)') , xlabel('f'), ylabel('UFM(j*2*π*f)'), legend('UFM(j*2*π*f)')
%Με τη χρήση των εντολών ylabel('text')
%,xlabel('text'), legend('text'), title('text'), 
%εισάγουμε κατάλληλους τίτλους αξόνων και γραφήματος, λεζάντα, πλέγμα και
%βαθμολόγηση αξόνων για τo φάσμα του διαμορφωμένου κατά συχνότητα σήματος uFM(t).


grid

pause(0);



%Εδώ δημιουργήσαμε τη βοηθητική συνάρτηση για τον υπολογισμό του
%Μετασχηματισμού Fourier του εκάστοτε συνεχούς σήματος που χρειάζεται.

function[M,m,df]=fftseq(m,ts,df)
fs=1/ts;

if(nargin==2)

    n1 = 0;

else
    
    n1 = fs/df;
end

n2 = length(m);


n = 2^(max(nextpow2(n1),nextpow2(n2)));


M = fft(m,n);


m = [m,zeros(1,n-n2)];


df = fs/n;

end
