%201500127 Δημήτρης Ορεινός

clc
clear all

%Αρχικά ορίζουμε το σήμα πληροφορίας m(t),
%ορίζοντας το κατάλληλο διάνυσμα χρόνου, με σταθερό χρονικό βήμα ts=0,001sec. 
%Το σήμα m(t)ορίζεται ως εξής:m(t)=sinc(100*t)=sin(100*π*t)/(100*π*t),για t
%που ανήκει στο χρονικό διάστημα(ορισμένο ως 
%χρονικό διάνυσμα t)[-t0,t0].
%Η συνάρτηση sinc(x) είναι ουσιαστικά ίσοδύναμη με τη συνάρτηση sin(pi*x)/(pi*x).
    %Οι τιμές που είναι δυνατόν να επιστρέψει η συνάρτηση sinc(x) είναι οι
    %εξής:
          %y = sin(pi*x)/(pi*x)    αν x ~= 0
           %y= 1                   αν x == 0
   
%Για τη συγκεκριμένη άσκηση ορίζουμε ως σταθερές 
%τη χρονική σταθερά t0=0,2sec, το χρονικό βήμα(Περίοδος Δειγματοληψίας)ts=0,0005sec, τη συχνότητα
%δειγματοληψίας fs=1/ts, το συχνοτικό βήμα df=0,25Hz,τη σταθερά Kf που
%εκφράζει την ευαισθησία συχνότητας που μετράται σε μονάδες Ηz/Volt
%Kf=50 Ηz/Volt
%και τη συχνότητα του φορέα fc=250Ηz. Ταυτόχρονα ορίζουμε  και το σήμα του
%φορέα, όπου c(t) =Αc*cos(2*π*fc*t), με Αc=1, το πλάτος του φέροντος κύματος.



t0=0.2;
ts=0.0005;
fc=250;
kf=100;
fs=1/ts;

df=0.25;


t=[-t0:ts:t0];


m=sinc(100*t);

c=cos(2*pi*fc*t);
%Ύστερα αφού ορίσαμε τα συνεχή σήματα πληροφορίας m(t) και φορέα c(t), θα
%ορίσουμε το διαμορφωμένο σήμα κατα συχνότητα (FM) uFM(t). Το σήμα uFM(t)
%ορίζεται για φορέα c(t)=Αc*cos(2*π*fc*t), όπου fc η συχνότητα του φορέα της μορφής από τη σχέση
%uFM(t)=Ac*cos(θ(t)), όπου θ(t) η γωνία του διαμορφωμένου σήματος και
%ισχύει ότι θ(t)=2*π*fc*t+φ(t), όπου φ(t) η φάση του διαμορφωμένου σήματος,
%που είναι συνάρτηση του σήματος πληροφορίας m(t)  και έτσι θα ορίσουμε
%την ανάλογη στο ρυθμό μεταβολής της φάσης στιγμιαία συχνότητα
%fi(t)=(1/2*π)*d(θ(t))/dt=fc+(1/2*π)*d(φ(t))/dt. Για το συγκεκριμένο σήμα η φ(t) θα δίνεται από τη σχέση:
%φ(t)=2*π*Kf*v(t)=200*π*v(t), όπου v(t) το ολοκλήρωμα του σήματος m(t) από το -άπειρο(στη πραγματικότητα από το -t0,
%διότι τα σήμα  m(t)έχει οριστεί στο διάστημα [-t0,t0])στη
%μεταβλητή t, το οποίο υπολογίζουμε με τη χρήση μιας forloop που φαίνεται
%στις παρακάτω γραμμές κώδικα. Τελικά fi(t)=100*π*d(v(t))/dt+fc=100*π*m(t)+fc.


v(1)=0;
for(i=1:length(t)-1)
v(i+1)=v(i)+m(i)*ts;
end

W=50;%Επειδή m(t)=sinc(100*t)=sin(100*π*t)/(100*π*t), τότε και
%επειδή το σήμα m(t) που μας δίνεται έχει θεωρητικά άπειρο φάσμα,
%όπως καταλήξαμε και προηγουμένως μέσω του μετασχηματισμού
%Fourier,ουσιαστικά θα επιλέξουμε μια μέγιστη συχνότητα μέσω της οποίας θα υπολογιστεί 
%το εύρος ζώνης του σήματος πληροφορίας.Επιλέγουμε ότι W=fmax=50 Hz.

bf=kf*max(abs(m))/W;

%Ύστερα θα υπολογίσουμε  τον δείκτη διαμόρφωσης FM από την εξίσωση βf=kf*α/W,που ισχύει για ημιτονοειδή σήματα πληροφορίας 
%θέτοντας α=max|m(t)| ώστε να υποστηρίζει σήματα πληροφορίας που δεν έχουν ημιτονοειδή μορφή, 
%όπως το σήμα m(t) που μας δώθηκε στην εκφώνηση της άσκησης. Ο δείκτης διαμόρφωσης εκφράζει 
%τη μέγιστη απόκλιση της στιγμιαίας συχνότητας του διαμορφωμένου σήματος uFM(t) fi(t) από τη συχνότητα του φορέα fc, 
%κανονικοποιημένη ως προς το εύρος ζώνης W.



u=cos(2*pi*fc*t + 2*pi*kf*v);%Με βάση όλα τα παραπάνω η τελική έκφραση για 
%uFM(t)=cos(2*π*200*t + 2*π*50*v)=cos(400*π*t)*cos(100*π*v)-sin(400*π*t)*sin(100*π*v),διότι ισχύει η
%τριγωνομετρική ταυτότητα cos(a+b)=cos(a)*cos(b)-sin(a)*sin(b), με a,b να
%ανήκουν στο διάστημα γωνιών [0,2*π].

%Επειδή v(t)=100*sin(500*π*t) είναι περιοδικό σήμα,το αναπτύσσουμε σε σειρά
%Fourier.Έτσι με τη βοήθεια των συναρτήσεων Bessel, μπορούμε
%να γράψουμε:uFM(t)=cos(400*π*t)*[J0(βf)+2*J2(βf)*cos(200*π*t)+2*J4(βf)*cos(400*π*t)+.....+2*J2*n(βf)*cos(200*n*π*t)]-
%sin(400*π*t)*[J1(βf)+2*J3(βf)*sin(200*π*t)+4*J4(βf)*sin(400*π*t)+.....+]=

figure(1);%Μέσω της εντολής figure ανοίγουμε ένα νέο παράθυρο σχεδίασης που το χωρίζουμε σε τρία μέρη.


subplot(3,1,1);


plot(t,m(1:length(t)));%Στο πρώτο παράθυρο σχεδιάζουμε τη γραφική παράσταση του σήματος m(t) 
%σε συνάρτηση με το χρόνο t,
%χρησιμοποιώντας την εντολή plot(x,y),
%όπου σαν ανεξάρτητη μεταβλητή x,θα θεωρήσουμε το χρόνο t(το
%διάνυσμα χρόνου t)και σαν εξαρτημένη μεταβλητή y, τις τιμές του 
%του σήματος m(t) ,για κάθε τιμή του χρόνου t(διάνυσμα χρόνου t).


axis([-0.2,0.2,-2.5,2.5]);%Ορίζουμε τα όρια του άξονα του χρόνου(τον θεωρούμε ως άξονα x, 
%αλλά και του άξονα των τιμών του σήματος m(t)(τον θεωρούμε ως άξονα y) 
%στη γραφική παράσταση του σήματος πληροφορίας m(t), μέσω της εντολής
%axis(xmin,xmax,ymin,ymax).


xlabel('t'),ylabel('m(t)'), legend('m(t)'), title('m(t)')%Με τη χρήση των εντολών ylabel('text')
%, xlabel('text'), legend('text'), title('text'), 
%εισάγουμε κατάλληλους τίτλους αξόνων και γραφήματος, λεζάντα, πλέγμα και
%βαθμολόγηση αξόνων για τo γράφημα  του σήματος πληροφορίας m(t).


grid

pause(0);




subplot(3,1,2);

plot(t,c(1:length(t)));%Στο δεύτερο παράθυρο σχεδιάζουμε τη γραφική παράσταση του σήματος φορέα c(t) 
%σε συνάρτηση με το χρόνο t,
%χρησιμοποιώντας την εντολή plot(x,y),
%όπου σαν ανεξάρτητη μεταβλητή x,θα θεωρήσουμε το χρόνο t(το
%διάνυσμα χρόνου t)και σαν εξαρτημένη μεταβλητή y, τις τιμές του 
%του σήματος του φορέα c(t) , για κάθε τιμή του χρόνου t(διάνυσμα χρόνου t).

axis([-0.2,0.2,-2.5,2.5]);%Ορίζουμε τα όρια του άξονα του χρόνου(τον θεωρούμε ως άξονα x, 
%αλλά και του άξονα των τιμών του σήματος c(t)(τον θεωρούμε ως άξονα y) 
%στη γραφική παράσταση του σήματος του φορέα c(t), μέσω της εντολής
%axis(xmin,xmax,ymin,ymax).


xlabel('t'),ylabel('c(t)'), legend('c(t)'), title('c(t)')%Με τη χρήση των εντολών ylabel('text')
%, xlabel('text'), legend('text'), title('text'), 
%εισάγουμε κατάλληλους τίτλους αξόνων και γραφήματος, λεζάντα, πλέγμα και
%βαθμολόγηση αξόνων για τo γράφημα  του σήματος  φορέα c(t).

grid

pause(0);


subplot(3,1,3);
plot(t,u(1:length(t)));%Στο τρίτο παράθυρο σχεδιάζουμε τη γραφική παράσταση 
%του διαμορφωμένου σήματος κατα συχνότητα uFM(t) 
%σε συνάρτηση με το χρόνο t,
%χρησιμοποιώντας την εντολή plot(x,y),
%όπου σαν ανεξάρτητη μεταβλητή x,θα θεωρήσουμε το χρόνο t(το
%διάνυσμα χρόνου t)και σαν εξαρτημένη μεταβλητή y, τις τιμές του 
%του σήματος uFM(t), για κάθε τιμή του χρόνου t(διάνυσμα χρόνου t).

axis([-0.2,0.2,-2.5,2.5]);%Ορίζουμε τα όρια του αξόνα του χρόνου(τον θεωρούμε ως άξονα x), 
%αλλά και του άξονα των τιμών του σήματος uFM(t)(τον θεωρούμε ως άξονα y) 
%στη γραφική παράσταση του διαμορφωμένου κατά συχνότητα σήματος uFM(t), μέσω της εντολής
%axis(xmin,xmax,ymin,ymax).



xlabel('t'),ylabel('u(t)'), legend('u(t)'), title('u(t)')
%Με τη χρήση των εντολών ylabel('text')
%, xlabel('text'), legend('text'), title('text'), 
%εισάγουμε κατάλληλους τίτλους αξόνων και γραφήματος, λεζάντα, πλέγμα και
%βαθμολόγηση αξόνων για τo γράφημα  του σήματος uFM(t).



grid

pause(0);


figure(2)%Μέσω της εντολής figure ανοίγουμε ένα νέο παράθυρο σχεδίασης.

plot(t,v);%Σχεδιάζουμε τη γραφική παράσταση 
%του  σήματος v(t) 
%σε συνάρτηση με το χρόνο t,
%χρησιμοποιώντας την εντολή plot(x,y),
%όπου σαν ανεξάρτητη μεταβλητή x,θα θεωρήσουμε το χρόνο t(το
%διάνυσμα χρόνου t)και σαν εξαρτημένη μεταβλητή y, τις τιμές του 
%του σήματος v(t), για κάθε τιμή του χρόνου t(διάνυσμα χρόνου t).


axis([min(t),max(t),min(v),max(v)]);%Ορίζουμε τα όρια του άξονα του χρόνου(τον θεωρούμε ως άξονα x, 
%αλλά και του άξονα των τιμών του σήματος c(t)(τον θεωρούμε ως άξονα y) 
%στη γραφική παράσταση του σήματος v(t), μέσω της εντολής
%axis(xmin,xmax,ymin,ymax).

title('v(t)') , xlabel('t'), ylabel('v(t)'), legend('v(t)')%Με τη χρήση των εντολών ylabel('text')
%, xlabel('text'), legend('text'), title('text'), 
%εισάγουμε κατάλληλους τίτλους αξόνων και γραφήματος, λεζάντα, πλέγμα και
%βαθμολόγηση αξόνων για τo γράφημα  του σήματος v(t).

grid
%Με τη χρήση της βοηθητικής συνάρτησης [M,m,df]=fftseq(m,ts,df) και
%παράλληλα από τον γνωστό ορισμό του μετασχηματισμού Fourier 
%για τα συνεχή σήματα, δηλαδή το ολοκλήρωμα από το 0 εώς το t0(Όλα τα
%σήματα m(t), c(t) και uAM(t) τα ορίσαμε στο διάστημα [0,t0]) γινομένου του εκάστοτε σήματος με
%τον εκθετικό όρο e^(-j*2*π*f*t).Η παραπάνω αναλυτική μέθοδος 
% για το διαμορφωμένο κατά συχνότητα σήμα uFM(t), έχει τέτοιο βαθμό
%δυσκολίας που ουσιαστικά δεν είναι εφικτή η πραγματοποίησή της.Έτσι παρακάτω θα παρουσιαστεί περιγραφικά 
%ένας προσεγγιστικός τρόπος της εύρεσης του μετσχηματισμού Fourier του σήματος uFM(t), χρησιμοποιώντας το ανάπτυγμα Taylor. 
%Για τα σήματα m(t) και c(t) υπολογίζουμε αναλυτικά μέσω του γνωστού ορισμού του μετασχηmaτισμού Fourier 
%,αλλά και μέσω των παρακάτω γραμμών κώδικα τους μετασχηματισμούς
%Fourier των σημάτων αυτών.
%Τελικά θα προκύψει το ίδιο
%αποτέλεσμα και με τους δύο τρόπους για τα δύο αυτά σήματα, δηλαδή: 

%Όσον αφορά το σήμα πληροφορίας m(t) θα ισχύει ότι:
%Από την ιδιότητα συμμετρίας του Μ/Σ Fourier 
%προκύπτει ότι:
%Μ(j*2*π*f)=(0,01)*(u(f+50)-u(f-50)),όπου u(f) η συνάρτηση παλμού,δηλαδή η διαφορά δύο τετραγωνικών παλμών που
%προσεγγίζονται σε ιδανικούς τετραγωνικούς παλμούς, όσο το "κεντραρισμένο"
%διάστημα συχνοτήτων στο μηδέν επεκτείνεται σε τιμές συχνότητας f που
%προσεγγίζουν το άπειρο με τη συγκεκριμένη συνάρτηση, να
%"ακουμπάει"(δηλαδή να αρχίσει και να σταματήσει να παίρνει τιμές) τόσο ο παλμός του θετικού ημιάξονα, 
%όσο και ο παλμός του αρνητικού ημιάξονα , στις συχνότητες |f|=100Hz .
%Αυτή η συνάρτηση(θετική και αρνητική συχνοτική συνιστώσα) θα πάρει τη μέγιστη τιμή της 
%που είναι ίση με 0,01, για |f|=50Hz.



%Για συχνότητα φορέα fc=250Hz

%C(j*2*π*f)=0,5*(δ(f+250)+δ(f-250)), δηλαδή το άθροισμα δύο συναρτήσεων δέλτα που
%προσεγγίζονται από στενούς παλμούς,με τη συγκεκριμένη συνάρτηση, να
%"ακουμπάει"(δηλαδή να αρχίσει και να σταματήσει να παίρνει τιμές) τόσο η θετική, όσο και η
%αρνητική συχνοτική συνιστώσα της, στη συχνότητες |f|=200Hz και |f|=300Hz .
%Αυτή η συνάρτηση(θετική και αρνητική συχνοτική συνιστώσα) θα πάρει τη μέγιστη τιμή της 
%που είναι ίση με 0,5, για |fc|=200Hz.Στο διάγραμμα όμως που προκύπτει από
%τη matlab, η μέγιστη τιμή είναι μικρότερη του 0,5, διότι έχουμε διαιρέσει
%το μετασχηματισμό Fourier fs=1/ts=1/0,0005=2000 Ηz. Αυτή η μεγάλη συχνότητα
%δειγματοληψίας μας εξασφαλίζει μεγαλύτερη ακρίβεια στην αναπαράσταση του
%σήματος.

% UFM(j*2*π*f)=(Ac/2)*[F[cos(φ(t)](για(f-fc))+F[cos(φ(t)](για(f+fc))+j*F[sin(φ(t)](για(f-fc))]
%-0,5*j*F[sin(φ(t)](για(f+fc)) ,επειδή όμως για το συγκεκριμένο σήμα είναι δύσκολο να βρεθεί ακριβής έκφραση 
%για το μετασχηματισμό Fourier, προσεγγίζουμε τους όρους cos(φ(t))και sin(φ(t)) του σήματος uFM(t), 
%μέσω του αναπτύγματος Taylor,δηλαδή cos(φ(t))=1-φ(t)^2/2!+φ(t)^4/4! 
%και sin(φ(t))=φ(t)-φ(t)^3/3!+φ(t)^5/5!.Τελικά η συνάρτηση uFM(t)για πλάτος Ac=1 θα γίνει:
% uFM(t)=cos(400*π*t)-((100*π*v(t))^2/2!)*cos(400*π*t)+((100*π*v(t))^4/4!)*cos(400*π*t)+cos(400*π*t)-((100*π*v(t))^3/3!)
%*cos(400*π*t)+((100*π*v(t))^5/5!)*cos(400*π*t)-.......(Το σήμα φ(t) έχει μετασχηματισμό Fourier
%Φ(j*2*π*f)).
%και επίσης, χρησιμοποιώντας την ιδιότητα της Διαμόρφωσης του Μετασχηματισμού Fourier με φ(t)=100*π*v(t)  θα ισχύει ότι:
% η UFM(j*2*π*f) έχει αθρόισματα από συναρτήσεις δέλτα και Φ(j*2*π*f), αλλά
%και διαφορές συναρτήσεων Φ(j*2*π*f).

%Με ανάλογη λογική μπορούμε,προσεγγιστικά πάντα,να βγάλουμε αντίστοιχες σχέσεις και
%συμπεράσματα,εκφράζοντας το σήμα m(t) με συχνότητα fm σαν άθροισμα συνημιτόνων και έπειτα χρησιμοποιώντας 
%τις συναρτήσεις Bessel  με όρισμα τον δείκτη διαμόρφωσης βf=β,όπου δεν ισχύει ότι βf<<1, και τάξης n
%(βf και n πραγματικοί αριθμοί)που έχει τις εξής ιδίότητες:
%1)Jn(β) είναι πραγματική συνάρτηση, 2)J-n(β)=(-1)^n*Jn(β)και 3)άθροισμα από το -άπειρο
%στο +΄άπειρο των όρων (Jn(b))^2 να ισούται με 1.

%Προκύπτουν τα ακόλουθα αυμπεράσματα:

%1) Το φάσμα του σήματος FM αποτελείται από ένα άπειρο πλήθος
%φασματικών συνιστωσών, μια από τις οποίες αντιστοιχεί στο
%φορέα (συχνότητα fc) και άπειρες πλευρικές φασματικές
%συνιστώσες στις συχνότητες fc± n*fm (n = 1,2,...)
%2)Το πλάτος των φασματικών συνιστωσών εξαρτάται από τις τιμές της
%συνάρτησης Jn(β).
%3)Το πλάτος της φασματικής συνιστώσας του φορέα είναι J0(β), ενώ το
%πλάτος της φc± nφm φασματικής συνιστώσας είναι Jn(β).
%4)Από τους σχετικούς πίνακες για τη συνάρτηση Bessel γίνεται φανερό ότι όσο αυξάνεται το n
%(δηλαδή η τάξη της αντίστοιχης αρμονικής), τόσο η Jn(β) (δηλαδή το
%μέγεθος των αντίστοιχων αρμονικών) μειώνεται.
%5)Πρακτικά οι υψηλής τάξης αρμονικές μπορούν να θεωρηθούν
%αμελητέες, με την έννοια ότι το σύνολο της ισχύος του σήματος FM
%είναι συγκεντρωμένο σε πεπερασμένο εύρος συχνοτήτων, που
%εξαρτάται από την παράμετρο β.

[M,m,df1]=fftseq(m,ts,df);

M=M/fs;

f=[0:df1:df1*(length(m)-1)]-fs/2;%Ορίζουμε κατάλληλο "κεντραρισμένο διάστημα συχνοτήτων στο 0, ώστε αργότερα 
%να σχεδιάσουμε τα φάσματα των σημάτων m(t),c(t) και uFΜ(t).


[C,c,df1] = fftseq(c,ts,df);

C=C/fs;


[U,u,df1]=fftseq(u,ts,df);

U=U/fs;

%Επίσης από τον υπολογισμό του μετασχηματισμού Fourier γα το διαμορφωμένο
%σήμα uFM(t),προκύπτουν τα εξής συμπεράσματα:
%1)Το εύρος ζώνης του σήματος είναι ίσο με W, άρα το εύρος ζώνης των
%σημάτων φ(t)^n είναι ίσο με n*W. ’ρα το φάσμα του διαμορφωμένου σήματος
%κατά συχνότητα(FM) δεν είναι περιορισμένο, αλλά εκτείνεται από το -άπειρο
%στο +άπειρο, διότι και το n μπορεί να λάβει άπειρες τιμές.’ρα το εύρος
%ζώνης του σήματος είναι άπειρο.
%2) Tο φάσμα του διαμορφωμένου σήματος αποτελείται από το φάσμα του
%φέροντος κύματος, αλλά και από τα αντίστοιχα φάσματα των φ(t)^n, με
%κέντρο τη συχνότητα fc, όπου όσο μεγαλώνει η δύναμη n των σημάτων φ(t)^n
%τόσο το φασματικό πλάτος μειώνεται, επομένως αναφερόμαστε σε φασματικό
%περιεχόμενο, το οποίο βρίσκεται σε ολοένα και μεγαλύτερη απόσταση από τη
%συχνότητα fc, κάτι που φαίνεται και από τη μέιωση που παρουσιάζουν οι μη
%γραμμικοί όροι cos(φ(t))και sin(φ(t)), αναπτυσσομενοι κατά Taylor.
%3)Για μη περιοδικά σήματα ο υπολογισμός του εύρους του φάσματος, που καταλαμβάνει το σήμα πληροφορίας m(t), 
%είναι μία διαδικασία η οποία εξαρτάται άμεσα από το ποσοστό της ποσότητας
%πληροφορίας του σήματος πληροφορίας που ενδιαφέρει να περικλείει το διαμορφωμεένο σήμα.

%Επειδή ο δείκτης διαμόρφωσης βf που προκύπτει,μέσω του προγράμματος σε matlab,ισούται με 2, 
%άρα δεν ισχύει ότι βf<<1, τότε στην σχέση για το σήμα uFM(t), 
%οι όροι ανώτερης τάξης δεν μπορούν να αγνοηθούν και θα έχουμε διαμόρφωση συχνότητας
%ευρείας ζώνης(WBFM).
%Όμως πέρα από τα παραπάνω μας ενδιαφέρει και το ενεργό εύρος ζώνης το
%οποίο περιέχει ένα μεγάλο μέρος της ισχύος του διαμορφωμένου σήματος, σε
%ποσοστό μεγαλύτερο από 99%. Tο ενεργό εύρος ζώνης μπορεί να προσεγγιστεί με μεγάλη ακρίβεια, 
%χρησιμοποιώντας τονκανόνα του Carson ο οποίος διατυπώνεται ως εξής:
%BT=2*W*(βf+1)=300 Hz.
%Οι παρακάτω γραμμές κώδικα συμπίπτουν ακριβώς με το
%θεωρητικό υπολογισμό που κάνουμε για το ενεργό εύρος ζώνης, συνεπώς τα
%αποτελέσματα των θεωρητικών υπολογισμών αλλά και των υπολογισμών στη
%matlab είναι ακριβώς τα ίδια.  Όσον αφορά την ισχύ του σήματος uFM(t),όπου
%ισχύει ότι το ολοκλήρωμα από το -t0 στο t0 της συνάρτησης uFM(t)^2 PFM=Ac^2/2=1/2,
%αυτή λόγω σταθερού πλάτους του σήματος uFM(t),θα
%είναι σταθερή, που σημαίνει ότι χωρίς να μεταβάλλεται η τιμή της
%ανακατανέμεται σε όλες τις συνιστώσες του φάσματος, δηλαδή στις 
%πλευρικές ζώνες του φάσματος.

%Επίσης αν θεωρούσαμε ότι το εύρος ζώνης είναι: 1)W=500 Hz ή ότι 2)W=5000Hz, τότε για
%τον δείκτη διαμόρφωσης βf και για το ενεργό εύρος ζώνης ΒT ισχύει
%ότι:1)βf=0,2 και ΒΤ=1200Ηz=1,2kHz και 1)βf=0,02 και ΒΤ=10200Ηz=10,2kHz. Τελικά
%συμπεραίνουμε ότι όσο αυξάνουμε το εύρος ζώνης W, τόσο μειώνεται ο δείκτης
%διαμόρφωσης βf, άρα και η μέγιστη απόκλιση της στιγμιαίας συχνότητας του διαμορφωμένου σήματος uFM(t) 
%fi(t) από τη συχνότητα του φορέα fc, δηλαδή ο όρος max(fi(t)-fc)=max((1/2*π)*d(φ(t))/dt)=50*π*max(m(t)).
% Επίσης θα παρατηρηθεί αύξηση του ενεργού εύρος ζώνης, δηλαδή το μεγάλο μέρος της ισχύος του διαμορφωμένου σήματος, σε
%ποσοστό μεγαλύτερο από 99%, που περιέχει θα είναι το ίδιο και περισσότερο "απλωμένο" στο φάσμα του σήματος uFM(t).


B=(bf+1)*2*W;




print -dbitmap modfm2a;
pause(0);




figure(3)%Μέσω της εντολής figure ανοίγουμε ένα νέο παράθυρο σχεδίασης που το χωρίζουμε σε τρία μέρη.

subplot(3,1,1);

plot(f,abs(fftshift(M)));%Στο πρώτο παράθυρο σχεδιάζουμε τη γραφική παράσταση του σήματος του φορέα
%c(t) σε συνάρτηση με τη συχνότητα f ,
%χρησιμοποιώντας την εντολή plot(x,y),
%όπου σαν ανεξάρτητη μεταβλητή x,θα θεωρήσουμε τη συχνότητα f("κεντραρισμένο" διάνυσμα συχνοτήτων f στο μηδέν)
%και σαν εξαρτημένη μεταβλητή y, τις τιμές του 
%του σήματος πληροφορίας m(t) ,για κάθε τιμή της συχνότητας f("κεντραρισμένο" διάνυσμα συχνοτήτων f στο μηδέν)


title('M(j*2*π*f)') , xlabel('f'), ylabel('M(j*2*π*f)'), legend('M(j*2*π*f)')
%Με τη χρήση των εντολών ylabel('text')
%, xlabel('text'), legend('text'), title('text'), 
%εισάγουμε κατάλληλους τίτλους αξόνων και γραφήματος, λεζάντα, πλέγμα και
%βαθμολόγηση αξόνων για τo φάσμα του μέτρου του "κεντραρισμένου" στο μηδέν
%Μετασχηματισμού Fourier FFT του σήματος πληροφορίας m(t).


grid

subplot(3,1,2);



plot(f,abs(fftshift(C)));%Στο δεύτερο παράθυρο σχεδιάζουμε τη γραφική παράσταση του σήματος του φορέα
%c(t) σε συνάρτηση με τη συχνότητα f ,
%χρησιμοποιώντας την εντολή plot(x,y),
%όπου σαν ανεξάρτητη μεταβλητή x,θα θεωρήσουμε τη συχνότητα f("κεντραρισμένο" διάνυσμα συχνοτήτων f στο μηδέν)
%και σαν εξαρτημένη μεταβλητή y, τις τιμές του του μέτρου του "κεντραρισμένου" στο μηδέν
%Μετασχηματισμού Fourier FFT
%του σήματος του φορέα c(t) ,για κάθε τιμή της συχνότητας f("κεντραρισμένο"
%διάνυσμα συχνοτήτων f στο μηδέν).


title('C(j*2*π*f)') , xlabel('f'), ylabel('C(j*2*π*f)'), legend('C(j*2*π*f)')
%Με τη χρήση των εντολών ylabel('text')
%, xlabel('text'), legend('text'), title('text'), 
%εισάγουμε κατάλληλους τίτλους αξόνων και γραφήματος, λεζάντα, πλέγμα και
%βαθμολόγηση αξόνων για τo γράφημα του μέτρου του "κεντραρισμένου"
%Μετασχηματισμού Fourier FFT του σήματος του φορέα c(t).


grid

subplot(3,1,3);


plot(f,abs(fftshift(U)));%Στο τρίτο παράθυρο σχεδιάζουμε τη γραφική παράσταση του διαμορφωμένου κατα συχνότητα σήματος(FM)
%uFM(t) σε συνάρτηση με τη συχνότητα f ,
%χρησιμοποιώντας την εντολή plot(x,y),
%όπου σαν ανεξάρτητη μεταβλητή x,θα θεωρήσουμε τη συχνότητα f("κεντραρισμένο" διάνυσμα συχνοτήτων f στο μηδέν)
%και σαν εξαρτημένη μεταβλητή y, τις τιμές του του μέτρου του "κεντραρισμένου" στο μηδέν
%Μετασχηματισμού Fourier FFT
%του σήματος uFM(t) ,για κάθε τιμή της συχνότητας f("κεντραρισμένο"
%διάνυσμα συχνοτήτων f στο μηδέν).

title('UFM(j*2*π*f)') , xlabel('f'), ylabel('UFM(j*2*π*f)'), legend('UFM(j*2*π*f)')
%Με τη χρήση των εντολών ylabel('text')
%,xlabel('text'), legend('text'), title('text'), 
%εισάγουμε κατάλληλους τίτλους αξόνων και γραφήματος, λεζάντα, πλέγμα και
%βαθμολόγηση αξόνων για τo φάσμα του διαμορφωμένου κατά συχνότητα σήματος uFM(t).


grid

pause(0);


%Εδώ δημιουργήσαμε τη βοηθητική συνάρτηση για τον υπολογισμό του
%Μετασχηματισμού Fourier του εκάστοτε συνεχούς σήματος που χρειάζεται.

function[M,m,df]=fftseq(m,ts,df)
fs=1/ts;

if(nargin==2)

    n1 = 0;

else
    
    n1 = fs/df;
end

n2 = length(m);


n = 2^(max(nextpow2(n1),nextpow2(n2)));


M = fft(m,n);


m = [m,zeros(1,n-n2)];


df = fs/n;

end
