%201500127 Δημήτρης Ορεινός ’σκηση 2.3

%Αρχικά ορίζουμε το σήμα διακριτού χρόνου x[n] που μας δίνεται από την εκφωνηση της άσκησης,
% ορίζοντας σταθερό χρονικό βήμα time_step=1, μιας και μιλάμε για διακριτό σήμα. 
%Πιο συγκεκριμένα το σήμα x[n] ορίζεται ως εξής:
%x(t)=(0,9)^(n), με το n(ως διάνυσμα χρόνου n1) να περιλαμβάνει τις τιμές του
%διαστήματος [0,20]

clc
clear all



n1=[0:20];


x=(0.9).^(n1);






%Έπειτα μέσω της εντολής figure ανίογουμε ένα νέο παράθυρο σχεδίασης. 

figure

subplot(2,1,1)%Με τη χρήση  της εντολής subplot(m,n,p), (όπου ο τελευταίος δείκτης p
%ορίζει ποιο παράθυρο κάθε φορά είναι ανοιχτό),χωρίζουμε το παράθυρο σχεδίασης σε δύο μέρη. 


 
 stem(n1,x)%Σχεδιάζουμε στο πρώτο παράθυρο το σήμα x[n],χρησιμοποιώντας την εντολή stem(x,y),
%όπου σαν ανεξάρτητη μεταβλητή x,θα θεωρήσουμε το χρόνο n και σαν
%εξαρτημένη μεταβλητή y, τις τιμές του σήματος x[n], για κάθε τιμή του
%χρόνου n.
 
grid  

ylabel('x[n]'), xlabel('n'), legend('x[n]'), title('x[n]')%Με τη χρήση των εντολών ylabel('text')
%, xlabel('text'), legend('text'), title('text'), 
%εισάγουμε κατάλληλους τίτλους αξόνων και γραφήματος, λεζάντα, πλέγμα και
%βαθμολόγηση αξόνων για τo γράφημα του σήματος x[n].


w=[-4*pi:0.01:4*pi]; %Ορίζουμε ένα διάνυσμα συχνοτήτων στο διάστημα [-10:10] με σταθερό συχνοτικό 
%βήμα freq_step =0.1.

%Στη συνέχεια υπολογίζουμε το μετασχηματισμό Fourier, χρησιμοποιώντας ένα forloop.
%Έτσι θα επιτύχουμε να εφαρμόσουμε ακριβώς τον ορισμό του αθροίσματος που
%αντιστοιχεί στο μετασχηματισμό Fourier για τα διακριτά σήματα,
%δηλαδή σε κάθε loop, για μία συγκεκριμένη τιμή του χρόνου n, να αθροίζουμε ως προς τον χρόνο το x[n].







X=0;
g=0;
for r=0:20
   g=g+1;
    X=X+x(g).*exp(-j*r*w);
end




subplot(2,1,2)



plot(w,abs(X))%Σχεδιάζουμε στο δεύτερο παράθυρο το μέτρο του μετασχηματισμού Fourier του σήματος x[n]
%|X[exp(j*ω)]|,χρησιμοποιώντας την εντολή stem(x,y),
%όπου σαν ανεξάρτητη μεταβλητή x,θα θεωρήσουμε το χρόνο n(διάνυσμα χρόνου n1) και σαν
%εξαρτημένη μεταβλητή y, τις τιμές του μέτρου του Μετασχηματισμού Fourier του σήματος x[n]|X[exp(j*ω)]|, 
%για κάθε τιμή του χρόνου n.

grid

ylabel('|X[exp(j*ω)]|'), xlabel('ω'), legend('|X[exp(j*ω)]|'), title('|X[exp(j*ω)]|')
%Με τη χρήση των εντολών ylabel('text')
%, xlabel('text'), legend('text'), title('text'), 
%εισάγουμε κατάλληλους τίτλους αξόνων και γραφήματος, λεζάντα, πλέγμα και
%βαθμολόγηση αξόνων για τo γράφημα του μέτρου του Μετασχηματισμού Fourier του σήματος x[n]|X[exp(j*ω)]|.


%Από τον πίνακα στοιχειωδών μετασχηματισμών Fourier διακριτών σημάτων
%βρίσκουμε ότι ο Μετασχηματισμού Fourier του σήματος x[n]=α^(n), με |α|=0,9<1 είναι η
%συνάρτηση Χ(exp(j*ω))=1/(1-0,9*exp(-j*ω)) και χρησιμοποιώντας τον τύπο του
%Euler exp(-j*ω)=cos(ω)-j*sin(ω), θα έχουμε Χ(exp(j*ω))=1/(1-0,9*cos(ω)+0,9*j*sin(ω)).
%Αυτή η σχέση δικαιολογεί απόλυτα τη μορφή του γραφήματος του μέτρου του Μετασχηματισμού Fourier 
%του σήματος x[n]|X[exp(j*ω)]| που προκύπτει.



Ex = sum(abs(x).^2) %Στη συνέχεια για αυτό το σήμα θα υπολογίσουμε την ενέργεια του η οποία υπολογίζεται
% μέσω του ολοκληρώματος της συνάρτησης |x(t)|^2 από τη τιμή 0 εώς τη τιμή 20, 
%καθώς το σήμα x[n] ορίζεται στο χρονικό διάστημα [0,20].

% Το μέτρο του σήματος x[n] το βρίσκουμε χρησιμοποιώντας την εντολή abs(x)


    
 %Έπειτα όπως φαίνεται από  τη  παρακάτω γραμμή κώδικα, 
%εφαρμόζουμε το θεώρημα του Parseval στο πεδίο των συχνοτήτων.Αυτό το
%θεώρημα διατυπώνεται ως εξής: Έστω X(exp(j*ω)) ο μετασχηματισμός Fourier του
%διακριτού σήματος x[n].Τότε η ενέργεια Εx του σήματος x[n] που ισούται, στο πεδίο του χρόνου, με
%το άθροισμα των τιμών του σήματος x[n] από 0  εώς το 20 υψωμένες στο τετράγωνο (|x(t)|^2), θα
%ισούται επίσης με το ολκολήρωμα στο χώρο των συχνοτήτων, διαιρούμενο κατα
%2π, από το 0 εώς το 2*π, της συνάρτησης |Χ(ω)|^2.

%Πράγματι διαπιστώνουμε ότι η ιδιότητα του Parseval ισχύει καθώς η ενέργεια
%που προκύπτει, τόσο στο χώρο των συχνοτήτων, όσο και στο χώρο του χρόνου
%είναι η ίδια(σχεδόν, καθώς και οι δύο τιμές ενέργείας είναι πολύ κοντά στη τιμή 5,2 
%με πολύ μικρές αποκλίσεις σε τάξη μεγέθους 10^(-3)).

%Ουσιαστικά προκύπτει ότι η ισχύς του σήματος x[n] για χρονικό διάστημα ίσο
%με μία περίοδο είναι ίσο με το άθροισμα των τιμών του σήματος x[n] υψωμένες στο τετράγωνο, για
%κάθε n.

%Τα ολοκληρώματα της ενέργειας τόσο στο χώρο του χρόνου, όσο και στο χώρο
%των συχνοτήτων, δεν υπολογίζονται χρησιμοποιώντας συμβολικές μεταβλητές,
%αλλά με αριθμητικό τρόπο και πιο συγκεκριμένα χρησιμποιώντας την εντολή
%trapz(X,Y), όπου Χ θεωρούμε τη μεταβλητή ως προς την οποία ολοκληρώνουμε,
%δηλαδή το μέγεθος της συχνότητας και Υ το μέγεθος το οποίο ολοκληρώνουμε,
%δηλαδή το μέτρο του Μετασχηματισμού Fourier του σήματος x(t) υψωμένο στο
%τετράγωνο |Χ(j*Ω)|^2.

E=1/(2*4*pi)*trapz(w,abs(X).^2)%Διαιρούμε το ολοκλήρωμα αυτό της ενέργειας 
%στο χώρο των συχνοτήτων με το χρονικό βήμα 2*π/(max(ω)-min(ω))=2*π/8*π=1/4.
%Tο συγκεκριμένο χρονικό όρο τον πολλαπλασιάζουμε στην ενέργεια Ε, διότι η
%συγκεκριμένη ενέργεια, είναι συνολική για όλες τις περιόδους του σήματος 
%και όχι μόνο για μία περίοδο,καθώς στη προκειμένη περίπτωση θα έχουμε
%πολλές επαναλήψεις σήματος.
