%201500127 Δημήτρης Ορεινός ’σκηση 2.2

%Αρχικά ορίζουμε το σήμα συνεχούς χρόνου x(t) που μας δίνεται από την εκφωνηση της άσκησης,
% ορίζοντας σταθερό χρονικό βήμα time_step=0.01. Πιο συγκεκριμένα το σήμα x(t) ορίζεται
%ως εξής:
%x(t)=sinc(t)=sin(π*t)/π*t, με το  χρόνο t(ορίζοντάς το σαν διάνυσμα χρόνου t1)
%να περιλαμβάνει τις τιμές του διαστήματος [-4*π,4*π].
%Η συνάρτηση sinc(x) είναι ουσιαστικά ίσοδύναμη με τη συνάρτηση sin(pi*x)/(pi*x).
    %Οι τιμές που είναι δυνατόν να επιστρέψει η συνάρτηση sinc(x) είναι οι
    %εξής:
          %y = sin(pi*x)/(pi*x)    αν x ~= 0
           %y= 1                   αν x == 0
   
clc
clear all


t1=[-4*pi:0.01:4*pi];

%x=sinc(t1);
x=sinct(t1);






%Έπειτα μέσω της εντολής figure ανίογουμε ένα νέο παράθυρο σχεδίασης. 

figure

subplot(2,1,1)%Με τη χρήση  της εντολής subplot(m,n,p), (όπου ο τελευταίος δείκτης p
%ορίζει ποιο παράθυρο κάθε φορά είναι ανοιχτό),χωρίζουμε το παράθυρο σχεδίασης σε δύο μέρη. 


 
 plot(t1,x)%Σχεδιάζουμε στο πρώτο παράθυρο το σήμα x(t),χρησιμοποιώντας την εντολή plot(x,y),
%όπου σαν ανεξάρτητη μεταβλητή x,θα θεωρήσουμε το χρόνο t(διάνυσμα χρόνου t1) και σαν
%εξαρτημένη μεταβλητή y, τις τιμές του σήματος x(t), για κάθε τιμή του
%χρόνου t.
 
grid  

ylabel('x(t)'), xlabel('t'), legend('x(t)'), title('x(t)')%Με τη χρήση των εντολών ylabel('text')
%, xlabel('text'), legend('text'), title('text'), 
%εισάγουμε κατάλληλους τίτλους αξόνων και γραφήματος, λεζάντα, πλέγμα και
%βαθμολόγηση αξόνων για τo γράφημα του σήματος x(t).



%Στη συνέχεια υπολογίζουμε το μετασχηματισμό Fourier x(t), χρησιμοποιώντας ένα forloop και την εντολή trapz(Χ,Υ),
% όπου Χ θεωρούμε τη μεταβλητή ως προς την οποία ολοκληρώνουμε,
%δηλαδή το μέγεθος του χρόνου t(διάνυσμα χρόνου) και Υ το μέγεθος το οποίο ολοκληρώνουμε,
%δηλαδή το γινόμενο του σήματος x(t) με την εκθετική συνάρτηση
%exp(-j*Ω0*k*t),Ω0=2*π.
%Έτσι θα επιτύχουμε να εφαρμόσουμε ακριβώς τον ορισμό του ολοκληρώματος που
%αντιστοιχεί στο μετασχηματισμό Fourier
%δηλαδή σε κάθε loop, για μία συγκεκριμένη συχνότητα, να ολοκληρώνουμε ως προς τον χρόνο το x(t).

s=-20;
h=0;
for k=1:4001% Ως διαφορετικό τρόπο σκέψης αντι στην επανάληψη μας να αναφερθούμε 
%στις ίδιες τις συχνότητες που ανήκουν στο διάστημα [-20:20] με σταθερό συχνοτικό 
%βήμα freq_step = 0.01, χρησιμοποιούμε το πλήθος αυτών των συχνοτήτων που
%είναι ίσο με 4001.(Την ίδια λογική θα εφαρμόσουμε και σε όλα τα παρακάτω
%σήματα που θα σχεδιάσουμε).
   
   
    h(k)=trapz(t1,x.*exp(-j*2*pi*s*t1));
    s=s+0.01;
    
    
end

f1=[-20:0.01:20];%Ορίζουμε ένα διάνυσμα συχνοτήτων στο διάστημα [-20:20] με σταθερό συχνοτικό 
%βήμα freq_step = 0.01.

subplot(2,1,2)


plot(f1,abs(h));%Σχεδιάζουμε στο δεύτερο παράθυρο το το μέτρο του μετασχηματισμού Fourier του σήματος x(t) 
%|X(j*2*pi*f)|,χρησιμοποιώντας την εντολή plot(x,y),
%όπου σαν ανεξάρτητη μεταβλητή x,θα θεωρήσουμε το χρόνο t(διάνυσμα χρόνου t1) και σαν
%εξαρτημένη μεταβλητή y, το μέτρο του μετασχηματισμού Fourier του σήματος x(t)( διάνυσμα x), για κάθε τιμή του
%χρόνου t.
grid

ylabel('|Χ(j*2*pi*f)|'), xlabel('f'), legend('|Χ(j*2*pi*f)|'), title('|Χ(j*2*pi*f)|')
%Με τη χρήση των εντολών ylabel('text')
%, xlabel('text'), legend('text'), title('text'), 
%εισάγουμε κατάλληλους τίτλους αξόνων και γραφήματος, λεζάντα, πλέγμα και
%βαθμολόγηση αξόνων για τo γράφημα του μέτρου του μετασχηματισμού Fourier |X(j*2*pi*f)|.


%Από το γράφημα του μέτρου του μετασχηματισμού Fourier του σήματος x(t)|X(j*Ω)|,
%όπου ο μετασχηματισμός Fourier προκύπτει από το  αντίστοιχο ολοκλήρωμα 
%του σήματος x(t)(σελίδα 14 πίνακας εργαστηριακού οδηγού) ή και μέσω
%του πίνακα στοιχειωδών μετασχηματισμών Fourier , 
%διαπιστώνουμε πως για το σήμα x(t)=sinc(t)=sin(π*t)/π*t, ο αντίστοιχος
%μετασχηματισμός Fourier είναι ουσιαστικά ένας τετραγωνικός παλμός με
%πλάτος 1 για |f|<π, ο οποίος όμως εδώ δε προσεγγίζεται ιδανικά και με τη
%μεγαλύτερη ακρίβεια, διότι το γράφημά μας έχει σχεδιαστεί για πεπερασμένο
%διάστημα συχνοτήτων. Όσο λοιπόν αυτό το διάστημα περιελάμβανε όλο ένα και
%περισσότερες αλλά και μεγαλύτερες τιμές συχνότητας, τέτοιες ώστε να τείνει στο
%άπειρο,τότε θα προσεγγίζαμε σχεδόν ιδανικά τον τετραγωνικό παλμό παλμός με
%πλάτος 1 για |f|<π.Συγκεκριμένα ο τετραγωνικός παλμός για τον οποίο
%αναφερόμαστε "ακουμπάει", δηλαδή αρχίζει να παίρνει τιμές στις συχνότητες |f|=1.
%(με την άλλη f=1,να βρίσκεται στον αρνητικό ημιάξονα).


m=cos(20*pi*t1);%Έπειτα ορίζουμε το σήμα συνεχούς χρόνου m(t)=cos(20*π*t) που μας δίνεται
%από την εκφωνηση της άσκησης,στο ίδιο χρονικό διάστημα [-4*π,4*π]
% ορίζοντας το ίδιο σταθερό χρονικό βήμα time_step=0.01.


%Στη συνέχεια υπολογίζουμε το μετασχηματισμό Fourier του σήματος m(t), χρησιμοποιώντας ένα forloop και την εντολή trapz(Χ,Υ),
% όπου Χ θεωρούμε τη μεταβλητή ως προς την οποία ολοκληρώνουμε,
%δηλαδή το μέγεθος του χρόνου t(διάνυσμα χρόνου) και Υ το μέγεθος το οποίο ολοκληρώνουμε,
%δηλαδή το γινόμενο του σήματος m(t) με την εκθετική συνάρτηση
%exp(-j*Ω0*k*t),Ω0=2*π.
%Έτσι θα επιτύχουμε να εφαρμόσουμε ακριβώς τον ορισμό του ολοκληρώματος που
%αντιστοιχεί στο μετασχηματισμό Fourier
%δηλαδή σε κάθε loop, για μία συγκεκριμένη συχνότητα, να ολοκληρώνουμε ως προς τον χρόνο το m(t).


a=-20;
y1=0;
for k=1:4001
   
   
    y1(k)=(1/80*pi)*trapz(t1,m.*exp(-j*2*pi*a*t1));%Το ολοκλήρωμα του μετασχηματισμού Fourier
    %του σήματος m(t) που έχει περίοδο Τ=2*π/ω0=2*π/20*π=1/10, 
    %το πολλαπλσιάζουμε με τον όρο 1/80*π, (που είναι ο όρος
    %1/(max(t1)-max(t1))=1/8*π, απλά επειδή η περίοδος Τ=1/10 , έχουμε τον
    %όρο 1/(80*π)), για να προκύψουν σωστότερα αποτελέσματα,
    %κάνοντας ουσιαστικά κανονικοποίηση,αφού μιλάμε για πολλές επαναλήψεις του σήματος.
    a=a+0.01;
    
    
end

figure %Έπειτα μέσω της εντολής figure ανίογουμε ένα νέο παράθυρο σχεδίασης.

 %Χωρίζουμε το παράθυρο σχεδίασης που μόλις δημιουργήσαμε σε δύο μέρη. 

subplot(2,1,1)


plot(f1,abs(y1));%Σχεδιάζουμε στο πρώτο παράθυρο 
%το μέτρο του μετασχηματισμού Fourier του σήματος m(t) |M(j*2*pi*f)|,χρησιμοποιώντας την εντολή plot(x,y),
%όπου σαν ανεξάρτητη μεταβλητή x,θα θεωρήσουμε τη συχνότητα f(διάνυσμα συχνοτήτων f1) και σαν
%εξαρτημένη μεταβλητή y, τις τιμές του  μέτρου του μετασχηματισμού Fourier του σήματος m(t)|M(j*Ω)|, 
%για κάθε τιμή της συχνότητας f.
grid


ylabel('|M(j*2*pi*f)|'), xlabel('f'), legend('|M(j*2*pi*f)|'), title('|M(j*2*pi*f)|')%Με τη χρήση των εντολών ylabel('text')
%, xlabel('text'), legend('text'), title('text'), 
%εισάγουμε κατάλληλους τίτλους αξόνων και γραφήματος, λεζάντα, πλέγμα και
%βαθμολόγηση αξόνων για τo γράφημα του μέτρου του μετασχηματισμού Fourier του σήματος m(t)|M(j*Ω)|.



%Όσον αφορά το μέτρο του μετασχηματισμού Fourier του σήματος
%m(t)=cos(20*π*t)|M(j*Ω)|,υπολογίζοντας το αντίστοιχο ολοκλήρωμα 
%του σήματος x(t)(σελίδα 14 πίνακας εργαστηριακού οδηγού)ή αν συμβουλευτούμε 
%τον πίνακα στοιχειωδών μετασχηματισμών Fourier και κανοντας τη
%γραφική παράσταση του μέτρου του,συμπεραίνουμε πως πρόκειται για ένα
%άθροισμα δύο συναρτήσεων δέλτα (Dirac), δηλαδή
%Χ((j*Ω))=π*(δ(ω-20*π)+δ(ω+20*π)). 
%Επειδή όμως έχουμε ορίσει διάστημα συχνοτήτων f [-20:20] με σταθερό συχνοτικό 
%βήμα freq_step = 0.01, θα πρέπει η παραπάνω σχέση να μετατραπεί από σχέση
%σε ω σε σχέση σε f, διαιρώντας με 2*π, άρα θα έχουμε ότι
%Χ(f)=(1/2)*(δ(f-10)+δ(f+10)).Αυτές οι δύο συναρτήσεις δέλτα προσεγγίζονται
%από δύο πολύ στενούς τετραγωνικούς παλμούς με εύρος ε και ύψος 1/ε, (ώστε
%για ε που τείνει στο 0 η συνάρτηση δέλτα να τείνει στο άπειρο), με το
%εμβαδόν που περιβάλλεται σε αυτόν τον παλμό όσο μεγαλώνει ή μικραίνει το
%εύρος ε να ισούται με τη μονάδα.
%Με βάση όλα τα παραπάνω και λαμβάνοντας υπόψη πώς συσχετίζουμε τη
% κάθε συνάρτηση δέλτα με τη συνάρτηση φ(t)=1, τότε με βάση τις ιδίοτητες
% της δέλτα συνάρτησης, καταλήγουμε πώς ο τετραγωνικός παλμός που
% προσεγγίζει κάθε μία από τις δύο συναρτήσεις δέλτα έχει ύψος ίσο με 1.

%’ρα όλα τα παραπάνω μας βοηθούν να αντιληφθούμε ότι το πλάτος του
%μετασχηματισμού Fourier του σήματος m(t), αλλά και του μέτρου του
%μετασχηματισμού Fourier |M(j*2*pi*f)|, είναι ίσο με 0,5 και ότι οι συχνότητες στις
%οποίες "ακουμπάει" η κάθε μία από τις δέλτα(δηλαδή αρχίζει να παίρνει τιμές) είναι οι συχνότητες  
%|f|=10,5(10+ε/2) και |f|=9,5(10-ε/2).
%Ουσιαστικά ο ένας από τους δύο παλμούς που προσεγγίζει τη μία από τις δύο δέλτα βρίσκεται στον αρνητικό ημιάξονα
%συχνοτήτων.

%Η περίοδος του σήματος Τ0=2*π/20*π=0.1, και είναι πολύ μικρή σε σχέση με το χρονικό διάστημα [-4*π,4*π], 
%όποτε θα έχουμε πολλές επαναλήψεις του σήματος m(t) 


y=x.*m;%Έπειτα ορίζουμε το σήμα συνεχούς χρόνου y(t)=x(t)*m(t)=sin(π*t)/(π*t)*cos(20*π*t) που μας δίνεται
%από την εκφωνηση της άσκησης,στο ίδιο χρονικό διάστημα [-4*π,4*π]
% ορίζοντας το ίδιο σταθερό χρονικό βήμα time_step=0.01.

%Στη συνέχεια υπολογίζουμε το μετασχηματισμό Fourier του σήματος y(t), χρησιμοποιώντας ένα forloop και την εντολή trapz(Χ,Υ),
% όπου Χ θεωρούμε τη μεταβλητή ως προς την οποία ολοκληρώνουμε,
%δηλαδή το μέγεθος του χρόνου t(διάνυσμα χρόνου) και Υ το μέγεθος το οποίο ολοκληρώνουμε,
%δηλαδή το γινόμενο του σήματος y(t) με την εκθετική συνάρτηση
%exp(-j*Ω0*k*t),Ω0=2*π.
%Έτσι θα επιτύχουμε να εφαρμόσουμε ακριβώς τον ορισμό του ολοκληρώματος που
%αντιστοιχεί στο μετασχηματισμό Fourier
%δηλαδή σε κάθε loop, για μία συγκεκριμένη συχνότητα, να ολοκληρώνουμε ως προς τον χρόνο το y(t).


b=-20;
y2=0;
for k=1:4001
   
   
    y2(k)=trapz(t1,y.*exp(-j*2*pi*b*t1));
    b=b+0.01;
    
    
end

figure %Έπειτα μέσω της εντολής figure ανίογουμε ένα νέο παράθυρο σχεδίασης.

  
subplot(1,1,1)


plot(f1,abs(y2));%Σχεδιάζουμε  το μέτρο του μετασχηματισμού Fourier του σήματος m(t) |M(j*2*pi*f)|,
%χρησιμοποιώντας την εντολή plot(x,y), όπου σαν ανεξάρτητη μεταβλητή x,θα θεωρήσουμε τη συχνότητα f
%(διάνυσμα συχνοτήτων f1) και σαν εξαρτημένη μεταβλητή y,
%τις τιμές του  μέτρου του μετασχηματισμού Fourier του σήματος m(t)|M(j*Ω)|, 
%για κάθε τιμή της συχνότητας f.
grid

ylabel('|Y(j*2*pi*f)|'), xlabel('f'), legend('|Y(j*2*pi*f)|'), title('|Y(j*2*pi*f)|')
%Με τη χρήση των εντολών ylabel('text')
%, xlabel('text'), legend('text'), title('text'), 
%εισάγουμε κατάλληλους τίτλους αξόνων και γραφήματος, λεζάντα, πλέγμα και
%βαθμολόγηση αξόνων για τo γράφημα του μέτρου του μετασχηματισμού Fourier του σήματος y(t)|Y(j*Ω)|.


%Aπό τα τελευταίο γράφημα διαπιστώνουμε πως εφαρμόζεται η ιδιότητα της
%διαμόρφωσης του μετασχηματισμού Fourier ενός σήματος y(t)=m(t)*x(t).Αυτή η
%ιδιότητα λέει πως ο πολλαλπλασιασμός δύο σημάτων έχει ως αποτέλεσμα τη
%διαμόρφωση του πλάτους του ενός σήματος με τρόπο που καθορίζεται από το
%περιεχόμενο του άλλου σήματος.

%Για τη μαθηματική διατύπωση αυτής της ιδιότητας, χρησιμοποιήθηκαν οι
%ιδιότητες της γραμμικότητας,όπου αν οι  μετασχηματισμοί Fourier δύο σημάτων x(t) και y(t)
%είναι Χ(j*ω) και Y(j*ω), τότε για το σήμα z(t)=α*x(t)+β*y(t), ο
%μετασχηματισμός Fourier θα είναι Ζ(j*ω)=α*X(j*ω)+β*Y(j*ω),
%και της μετατόπισης στη συχνότητα, όπου αν ο  μετασχηματισμός Fourier ενός σημάτων x(t) 
%είναι Χ(j*ω) , τότε για το σήμα y(t)=exp(j*2*π*F0*t)*x(t), ο
%μετασχηματισμός Fourier θα είναι Y(j*ω)=X(ω-ω0),
%του μετασχηματισμού Fourier ενός σήματος y(t).

%’ρα ισχύει ότι F{x(t)*cos(ω0*t)}=(1/2)*(X(ω+ω0)+X(ω-ω0))

%Εφόσον λάβουμε υπόψη μας από την εκφώνηση της άσκησης ότι
%m(t)=cos(20*π*t) και x(t)=sin(π*t)/(π*t), εφαρμόζοντας τη παραπάνω
%διατύπωση, θα προκύψει ότι:
% Ο Μετασχηματισμός Fourier της συνάρτησης y(t) F{(sin(π*t)/(π*t))*cos(20*π*t)}
% θα είναι το άθροισμα δύο δέλτα συναρτήσεων που προσεγγίζονται η κάθε μία από έναν τετραγωνικό παλμό(όχι ιδανικό)
%, όπου θα παίρνουν τη μέγιστη τιμή πλάτους τους ίσης με 1/2 και οι δύο στη συχνότητα ω0=20*π ή  στη τιμή f0=10.
%Οι συχνότητες στις οποίες "ακουμπάει" η κάθε μία από τις δέλτα (δηλαδή αρχίζει να παίρνει τιμές) 
%είναι οι συχνότητες  |f|=10,5 και |f|=9,5.Ουσιαστικά ο ένας από τους δύο παλμούς που προσεγγίζει 
%τη μία από τις δύο δέλτα βρίσκεται στον αρνητικό ημιάξονα συχνοτήτων.

%Η παραπάνω διαπίστωση μας οδηγεί στο συμπέρασμα ότι η ιδιότητα της διαμόρφωσης ισχύει, διότι
%ουσιαστικά ο Μετασχηματισμός Fourier του σήματος y(t)|Υ(j*Ω)| που μας δίνει 
%το αποτέλεσμα του πολλαπλασιασμού των σημάτων m(t) και x(t) είναι ο Μετασχηματισμός Fourier του συνεχούς 
%σήματος x(t) |Χ(j*Ω)|, με την ισότητα αυτή να ισχύει και για τα μέτρα των
%μετασχηματισμών, όπου το πλάτος του x(t) διαμορφώνεται με βάση το
%περιεχόμενο του σήματος m(t). Έτσι αυτή η διαδικασία της διαμόρφωσης θα
%περάσει και μέσα στους μετασχηματισμούς Fourier (και στα μέτρα τους), των σημάτων y(t) και
%x(t),καθώς το μέτρο του μετασχηματισμού Fourier του σήματος x(t)|Χ(j*Ω)| θα μεταβληθεί με
%βάση το περιεχόμενο του μέτρου του μετασχηματισμού Fourier του σήματος m(t)|M(j*Ω)|
%για να προκύψει το αναμενόμενο αποτέλεσμα που βλέπουμε στα αντίστοιχα γραφήματα.

function y = sinct(x)
    % Handle the x = 0 case explicitly to avoid division by zero
    y = ones(size(x));
    idx = x ~= 0;
    y(idx) = sin(pi * x(idx)) ./ (pi * x(idx));
end



