%201500127 Δημήτρης Ορεινός ’σκηση 3.2


%Αρχικά ορίζουμε το σήμα διακριτού χρόνου x[n] που μας δίνεται από την εκφωνηση της άσκησης,
% ορίζοντας σταθερό χρονικό βήμα time_step=1, μιας και μιλάμε για διακριτό σήμα. 
%Πιο συγκεκριμένα το σήμα x[n] ορίζεται ως εξής:
%x[n]=(0,9)^(n), με το  χρόνο n(ως διάνυσμα χρόνου) να ορίζεται στο χρονικό διάστημα [0,N-1], όπου
%Ν=2^(4)=16.

clc
clear all

 

N=2^(4);


n=[0:N-1];


x=(0.9).^(n);






%Έπειτα μέσω της εντολής figure ανίογουμε ένα νέο παράθυρο σχεδίασης. 

figure

subplot(3,1,1)%Με τη χρήση  της εντολής subplot(m,n,p), (όπου ο τελευταίος δείκτης p
%ορίζει ποιο παράθυρο κάθε φορά είναι ανοιχτό),χωρίζουμε το παράθυρο σχεδίασης σε τρία μέρη. 


 
 stem(n,x)%Σχεδιάζουμε στο πρώτο παράθυρο το σήμα x[n],χρησιμοποιώντας την εντολή stem(x,y),
%όπου σαν ανεξάρτητη μεταβλητή x,θα θεωρήσουμε το χρόνο n και σαν
%εξαρτημένη μεταβλητή y, τις τιμές του σήματος x[n], για κάθε τιμή του
%χρόνου(χρονικού διανύσματος) n.
 
grid  

ylabel('x[n]'), xlabel('n'), legend('x[n]'), title('x[n]')%Με τη χρήση των εντολών ylabel('text')
%, xlabel('text'), legend('text'), title('text'), 
%εισάγουμε κατάλληλους τίτλους αξόνων και γραφήματος, λεζάντα, πλέγμα και
%βαθμολόγηση αξόνων για τo γράφημα του σήματος x[n].




k1=[0:N-1];%Όρίζουμε το διάνυσμα του αριθμού των δειγμάτων k, για το οποίο  k ισχύει ότι: 
%Έστω ότι δειγματοληπτούμε τη μία περίοδο ,για συχνότητες ω που ανήκουν στο
%διάστημα [0,2*π], του Μετασχηματισμού Fourier  διακριτού χρόνου (DTFT) του σήματος, 
%έτσι ώστε να πάρουμε N δείγματα συχνότητας.
%’ρα ωk=2*π/Ν=δω, όπου k είναι ο αριθμός του δείγματος ,ωk είναι η (κυκλική) συχνότητα στο
%δείγμα αυτό και δω η απόσταση μεταξύ των διαδοχικών δειγμάτων που
%παίρνουμε σε αυτή τη δειγματοληψία.




X=fft(x);%Ύστερα υπολογίζουμε το Διακριτό Μετασχηματισμό Fourier (DFT)του διακριτού σήματος x[n] 
%,χρησιμοποιώντας την εντολή fft(x) που αντιστοιχεί στον υπολογισμό του Γρήγορου Μετασχηματισμού Fourier(FFT), 
%όπου x το σήμα όπου θα εφαρμόσουμε τον μετασχηματισμό αυτόν(το διάνυσμα όπου θα εφαρμοστεί αυτή τη εντολή), 
%που εδώ είναι το διακριτό σήμα x[n].



Y=ifft(X);%Yπολογίζουμε τον Αντίστροφο Διακριτό Μετασχηματισμό Fourier (IDFT)του διακριτού σήματος x[n] 
%,χρησιμοποιώντας την εντολή ιfft(X) που αντιστοιχεί στον υπολογισμό του Αντιστρόφου Γρήγορου 
%Μετασχηματισμού Fourier(IFFT), όπου X το σήμα όπου θα εφαρμόσουμε τον μετασχηματισμό αυτόν
%(το διάνυσμα όπου θα εφαρμοστεί αυτή τη εντολή), που εδώ είναι το διακριτό σήμα x[n].


%Για τη συγκεκριμένη άσκηση, έχουμε υποθέσει ότι το μήκος της ακολουθίας L
%του σήματος x[n] και το μήκος M του εκάστοτε Μετασχηματισμού Fourier(Ευθύ
%ή Αντιστρόφου) είναι ίδια. Σε περίπτωση όμως που το μήκος του εκάστοτε
%Μετασχηματισμού είναι μικρότερο ή μεγαλύτερο από το αντίστοιχο μήκος της
%ακολουθίας, τότε οι εντολές fft(x) και ifft(X) διαχειρίζονται αυτό το
%ενδεχόμενο ως εξής: Aν L<M, τότε οι συγκεκριμένες εντολές προσθέτουν
%μηδενικά (όχι αυθαίρετα) στο μήκος της ακολουθίας για να έχουμε ίσο μήκος και στις δύο
%ακολουυθίες x[n] και X[k]. Αν L>M, τότε οι συγκεκριμένες εντολές αφαιρούν
%μηδενικά από το  μήκος της ακολουθίας ή αγνοούν τα  ψηφία που απομένουν πέρα από το 
%Νοστό στοιχείο της ακολουθίας για να έχουμε ίσο μήκος και στις δύο ακολουυθίες x[n] και X[k].

%Επιδιώκουμε το μήκος της ακολουθίας μας να είναι δύναμη του 2, λόγω της
%παρακάτω θεωρίας:
%Για τον υπολογισμό του  Διακριτού Μετασχηματισμού Fourier DFT χρειαζόμαστε Ν^2 πολλαπλασιασμούς και 
%Ν*(Ν-1) προσθέσεις. Συνεπώς το υπολογιστικό κόστος για τον υπολογισμό του DFT είναι ανάλογο του N^2, 
%το οποίο είναι ουσιαστικά απαγορευτικό για μεγάλες τιμές του Ν.
%Για τη μείωση του κόστους αυτού στην πράξη χρησιμοποιείται ο αλγόριθμος (με διάφορες παραλλαγές) 
%υπολογισμού του DFT, που ονομάζεται Γρήγορος Μετασχηματισμός Fourier (Fast Fourier Transform, FFT). 
%Οι αλγόριθμοι αυτοί κάνουν χρήση των ιδιοτήτων της περιοδικότητας και της γραμμικότητας 
%των μιγαδικών εκθετικών της μορφής e^(j*2*π/N)
%και υιοθετούν την προσέγγιση του «διαίρε και βασίλευε»: 
%Αν το μήκος της ακολουθίας, Ν, είναι άρτιος, τότε διαιρείται σε δύο ακολουθίες μήκους Ν/2. 
%Στη συνέχεια, αν και αυτές οι ακολουθίες έχουν άρτιο μήκος δειγμάτων, τότε διαιρούνται και αυτές 
%σε δύο ακολουθίες μήκους Ν/4 η καθεμία. Η διαδικασία αυτή συνεχίζεται μέχρι να μη διαιρείται άλλο 
%το μήκος των επιμέρους ακολουθιών. 
%Αποδεικνύεται ότι για μεγάλα Ν, το υπολογιστικό κόστος για τον υπολογισμό του DFT μιας ακολουθίας μήκους Ν 
%γίνεται ανάλογο του  N*log2(N), που είναι σημαντικά μικρότερο από το αρχικό. 
%Παρόμοια μεθοδολογία μπορεί να υιοθετηθεί και για τον υπολογισμό του IDFT, 
%χρησιμοποιώντας τον Αντίστροφο Γρήγορο Μετασχηματισμό Fourier (IFFT).

%Μέσω της παραπάνω μεθόδου ουσιαστικά στη στη γενική περίπτωση το Ν=r1*r2*.......*rv, όπου
%ri=r,i=1,2,....v, άρα  το Ν=r^v εκφράζεται σε σκθετική μορφή, όπου ri οι διάφοροι μικροί μετασχηματισμοί 
%που έγιναν παραπάνω, που επειδή θέλουμε να πετύχουμε το μικρότερο δυνατό υπολογιστικό κόστος και την 
%ελάχιστη δυνατή υπολογιστική πολυπλοκότητα θα
%το μήκος των ri θα είναι ίσο με 2 για κάθε i. Για αυτό η προσέγγιση
%"διαίρει και βασίλευε" στηρίζεται στον αλγόριθμο  βάσης r=2.
 
%Τελικά με βάση όλα τα παραπάνω επιδιώκουμε το μήκος της ακολουθίας μας να είναι δύναμη του 2,
%διότι μέσω της μεθόδου "διαίρει και βασίλευε", θέλουμε για ακολουθία με άρτιο αριθμό στοιχείων 
%να χωρίσουμε το μήκος της σε τέτοιο αριθμό υποδειγμάτων, με άρτιο αριθμό
%στοιχείων το καθένα, ώστε να φτάσουμε στο σημείο να μείνει μόνο ένα
%στοιχείο στο τέλος,αφού δεν θα μπορεί να διαιρεθεί άλλο το μήκος της
%ακολουθίας, που θα μας δώσει το ελάχιστο δυνατό υπολογιστικό κόστος και πολυπλοκότητα.
 
subplot(3,1,2)



stem(k1,abs(X));%Σχεδιάζουμε στο δεύτερο παράθυρο τον διακριτό Μετασχηματισμού Fourier(DFT) του σήματος x[n] X[k],
%χρησιμοποιώντας την εντολή stem(x,y), όπου σαν ανεξάρτητη μεταβλητή x,θα θεωρήσουμε τους δείκτες k και σαν
%εξαρτημένη μεταβλητή y, τις τιμές του διακριτού Μετασχηματισμού Fourier(DFT) του σήματος x[n] X[k], 
%για κάθε  αριθμό των δειγμάτων (διανύσματος αριθμού δειγμάτων k1)k.


grid


ylabel('X[k]'), xlabel('k'), legend('X[k]'), title('X[k]')
%Με τη χρήση των εντολών ylabel('text')
%, xlabel('text'), legend('text'), title('text'), 
%εισάγουμε κατάλληλους τίτλους αξόνων και γραφήματος, λεζάντα, πλέγμα και
%βαθμολόγηση αξόνων για τo γράφημα του διακριτού Μετασχηματισμού Fourier(DFT) του σήματος x[n] X[k].



subplot(3,1,3)



stem(k1,Y)%Σχεδιάζουμε στο τρίτο παράθυρο τον Αντίστροφο Διακριτό Μετασχηματισμού Fourier(IDFT) 
%του σήματος x[n], χρησιμοποιώντας την εντολή stem(x,y), όπου σαν ανεξάρτητη μεταβλητή x,θα 
%θεωρήσουμε τον αριθμό των δειγμάτων  k και σαν εξαρτημένη μεταβλητή y, τις τιμές του 
%Αντίστροφου Διακριτού Μετασχηματισμού 
%Fourier(DFT) του σήματος x[n] ,για κάθε αριθμό των δειγμάτων (διανύσματος αριθμού δειγμάτων k1)k.



grid



ylabel('xrec[k]'), xlabel('k'), legend('xrec[k]'), title('xrec[k]')
%Με τη χρήση των εντολών ylabel('text')
%, xlabel('text'), legend('text'), title('text'), 
%εισάγουμε κατάλληλους τίτλους αξόνων και γραφήματος, λεζάντα, πλέγμα και
%βαθμολόγηση αξόνων για τo γράφημα του Αντίστροφου Διακριτού Μετασχηματισμού Fourier(IDFT) του σήματος x[n],
%μέσω του οποίου προκύπτει το αρχικό σήμα x[n] ανακατασκευασμένο.



%Τελικά διαπιστώνουμε ότι τα αποτελέσματα της άσκησης 3.2 ταυτίζονται
%απόλυτα με τα αντίστοιχα αποτελέσματα της άσκησης 3.1.
