%201500127 Δημήτρης Ορεινός ’σκηση 3.3


%Αρχικά ορίζουμε το σήμα διακριτού χρόνου x[n] που μας δίνεται από την εκφωνηση της άσκησης,
% ορίζοντας σταθερό χρονικό βήμα time_step=1, μιας και μιλάμε για διακριτό σήμα. 
%Πιο συγκεκριμένα το σήμα x[n] ορίζεται ως εξής:
%x[n]=(0,9)^(n), με το  χρόνο n(ως διάνυσμα χρόνου) να ορίζεται στο χρονικό διάστημα [0,N-1], όπου
%Ν=2^(4)=16.

clc
clear all


 N=2^(4);


n=[0:N-1];


x=(0.9).^(n);


w=[-3*pi:0.01:3*pi];
%Για τη σχεδίαση του Μετασχηματισμού Fourier Διακριτού 
%Χρόνου(DTFT), θα πρέπει να ορίσουμε ένα διάστημα συχνοτήτων ω(μέσω
%συχνοτικού διανύσματος w με σταθερό συχνοτικό βήμα freq_step=0,01).






w_k=n*2*pi/N; %Ορίζουμε ένα διάνυσμα συχνοτήτων w_k  χρησιμοποιώντας τη γνωστή σχέση ωk=2*π/Ν.


w_k_shift=[-N/2:(N/2)-1]*2*pi/N;%Έπειτα για να καταφέρουμε να σχεδιάσουμε το Μετασχηματισμό Fourier Διακριτού 
%Χρόνου(DTFT),αλλά και τον Διακριτό Μετασχηματισμό Fourier(DFT)του διακριτού σήματος x[n] μαζί στο
%ίδιο γράφημα, θα πρέπει το διάνυσμα συχνοτήτων w_k που ορίσαμε να το
%«κεντράρoυμε» στο μηδέν, ώστε να μπορούμε να συγκρίνουμε ευκολότερα τα
%διαγράμματα των δύο μετασχηματισμών.






%Στη συνέχεια υπολογίζουμε το μετασχηματισμό Fourier, χρησιμοποιώντας ένα forloop.
%Έτσι θα επιτύχουμε να εφαρμόσουμε ακριβώς τον ορισμό του αθροίσματος που
%αντιστοιχεί στο μετασχηματισμό Fourier για τα διακριτά σήματα,
%δηλαδή σε κάθε loop, για μία συγκεκριμένη τιμή του χρόνου n κάθε φορά, 
%να αθροίζουμε ως προς τη συχνότητα ω το x[n].



X=0;
p=0;

for r=0:N-1
   p=p+1;
   
   X=X+x(p).*exp(-j*r*w);
end




y=fft(x);%Ύστερα υπολογίζουμε το Διακριτό Μετασχηματισμό Fourier (DFT)του διακριτού σήματος x[n] 
%,χρησιμοποιώντας την εντολή fft(x) που αντιστοιχεί στον υπολογισμό του Γρήγορου Μετασχηματισμού Fourier(FFT), 
%όπου x το σήμα όπου θα εφαρμόσουμε τον μετασχηματισμό αυτόν(το διάνυσμα όπου θα εφαρμοστεί αυτή τη εντολή), 
%που εδώ είναι το διακριτό σήμα x[n].



Y=fftshift(y);%Ανάλογα σκεπτόμενοι θα πρέπει ,για να αναπαρασταθούν o DTFT και ο DFT του διακριτού σήματος, 
%να «κεντράρουμε» και τον DFT του σήματος στο μηδέν. 
%Αυτό γίνεται με χρήση της εντολής fftshift(Χ),όπου όπου Χ το σήμα όπου θα εφαρμόσουμε τον μετασχηματισμό αυτόν
%(το διάνυσμα όπου θα εφαρμοστεί αυτή τη εντολή), 
%που εδώ είναι ο Γρήγορος Μετασχηματισμός Fourier (FFT) του διακριτού σήματος x[n].
 





%Έπειτα μέσω της εντολής figure ανίογουμε ένα νέο παράθυρο σχεδίασης. 

figure



subplot(1,1,1)




plot(w,abs(X))%Σχεδιάζουμε  το  μετασχηματισμό Fourier του σήματος x[n]
%X[exp(j*ω)],χρησιμοποιώντας την εντολή plot(x,y),
%όπου σαν ανεξάρτητη μεταβλητή x,θα θεωρήσουμε τη συχνότητα ω(το διάστημα συχνοτήτων [-3*π,3*π]) 
%με σταθερό συχνοτικό  βήμα freq_step =0.01. και σαν εξαρτημένη μεταβλητή y,
%τις τιμές του μέτρου του Διακριτού Μετασχηματισμού Fourier του σήματος x[n] X[k], 
%για κάθε τιμή της συχνότητας(διανύσματος συχνότητας w) ω.

grid

hold on


subplot(1,1,1)

stem(w_k_shift,abs(Y))%Σχεδιάζουμε στο ίδιο παράθυρο το διακριτό μετασχηματισμό Fourier του σήματος x[n]
%X[exp(j*ω)],χρησιμοποιώντας την εντολή plot(x,y),όπου σαν ανεξάρτητη μεταβλητή x,
%θα θεωρήσουμε τη συχνότητα ω(το κεντραρισμένο στο μηδέν διάνυσμα συχνοτήτων w_k_shift)  
%και σαν εξαρτημένη μεταβλητή y, 
%τις τιμές του μέτρου του Διακριτού Μετασχηματισμού Fourier του σήματος x[n] X[k], 
%για κάθε τιμή του χρόνου(χρονικού διανύσματος) n.



title("DTFT vs DFT");

xlabel("ω");

ylabel("Magnitude of Fourier");

legend("DTFT", "DFT");

%Με τη χρήση των εντολών ylabel('text')
%, xlabel('text'), legend('text'), title('text'), 
%εισάγουμε κατάλληλους τίτλους αξόνων και γραφήματος, λεζάντα, πλέγμα και
%βαθμολόγηση αξόνων για τo γράφημα που περιλαμβάνει ταυτόχρονα το Μετασχηματισμό Fourier Διακριτού Χρόνου 
%και το Διακριτό Μετασχηματισμό Fourier(DFT) του διακριτού σήματος x[n].

hold off

%Από τη θεωρία προκύπτει ότι ο Διακριτός Μετασχηματισμός Fourier (DFT) για
%ένα διακριτό σήμα x[n] ουσιαστικά προκύπτει από τη δειγματοληψία για μία
%περίοδο του  Μετασχηματισμού Fourier Διακριτού Χρόνου (DΤFT) του σήματος
%x[n] στις συχνότητες ωk=2*π/Ν.

%Η παραπάνω σχέση μεταξύ των δύο μετασχηματισμών επαληθεύεται, κάτι που
%φαίνεται και μέσα από το γράφημα,των DFT και DTFT συναρτήσει της
%συχνότητας ω(κεντραρισμένο διάνυσμα συχνότητας w_k_shift για τον DFT)
%που σχεδιάσαμε προηγουμένως.

%Όσον αφορά το Διακριτό Μετασχηματισμό Fourier (DFT) του σήματος x[n], ένας
%τρόπος για να μπορέσουμε να αυξήσουμε τα δείγματα Ν του DFT, θα πρέπει να
%παίρνουμε τα δείγματα σε κάθε μία περίοδο, σε οσο πιο κοντινή απόσταση δω γίνεται μεταξύ τους.

%’ρα τελικά συμπεραίνουμε ότι ο DFT θα προσεγγίζει καλύτερα μία περίοδο του
%DTFT, όταν θα αυξήσουμε τον αριθμό Ν που αντιστοιχεί στα δείγματα του και ουσιαστικά η δω=2*π/Ν απόσταση 
%μεταξύ των εκάστοτε διαδοχικών δειγμάτων γίνει η μικρότερη δυνατή. 
%Ουσιαστικά αφού o αριθμός δειγμάτων Ν πρέπει να μεγαλώνει 
%και αφού το μήκος L της ακολουθίας του σήματος x[n] μένει σταθερό,τότε θα ισχύει ότι Ν>L, άρα δε θα
% εμφανιστεί το φαινόμενο της αναδίπλωσης, όπου υπάρχει επαναλαμβανόμενη επικάλυψη των
% στιγμιοτύπων του DFT, για κάθε συχνότητα ω, 
%το οποίο δε συμβάλλει στην ακριβέστερη δυνατή αναπαράσταση του σήματος
%x[n] και ουσιαστικά αλλοιώνει το σήμα που θα προκύψει μετά τη
%δειγματοληψία.









Ex = sum(abs(x).^2) %Στη συνέχεια για αυτό το σήμα θα υπολογίσουμε την ενέργεια του η οποία υπολογίζεται
% μέσω του αθροίσματος της συνάρτησης |x[n]|^2 από τη τιμή 0 εώς τη τιμή N-1, 
%καθώς το σήμα x[n] ορίζεται στο χρονικό διάστημα [0,N-1].

% Το μέτρο του σήματος x[n] το βρίσκουμε χρησιμοποιώντας την εντολή abs(x)

E=(1/N)*sum(abs(y).^2)%Διαιρούμε το άθροισμα αυτό της ενέργειας 
%στο χώρο των συχνοτήτων με το χρονικό βήμα 1/Ν, όπου Ν η περίοδος του σήματος x[n], 
%επειδή ο υπολογισμός αυτός της ενέργειας γίνεται για μία μόνο περίοδο.
    
 %Έπειτα όπως φαίνεται από  τη  παρακάτω γραμμή κώδικα, 
%εφαρμόζουμε το θεώρημα του Parseval στο πεδίο των συχνοτήτων.Αυτό το
%θεώρημα διατυπώνεται ως εξής: Έστω X[k] ο μετασχηματισμός Fourier του 
%διακριτού σήματος x[n], με περίοδο Ν.Τότε η ενέργεια Εx του σήματος x[n] που ισούται, στο πεδίο του χρόνου, με
%το άθροισμα των τιμών του σήματος x[n] από 0  εώς το N-1 υψωμένες στο τετράγωνο (|x[n]|^2), θα
%ισούται επίσης με το άθροισμα στο χώρο των συχνοτήτων, διαιρούμενο κατά
%1/Ν, από το 0 εώς το Ν-1, της συνάρτησης |Χ(ω)|^2.

%Πράγματι διαπιστώνουμε ότι η ιδιότητα του Parseval ισχύει καθώς η ενέργεια
%που προκύπτει, τόσο στο χώρο των συχνοτήτων, όσο και στο χώρο του χρόνου
%είναι η ίδια(σχεδόν, καθώς και οι δύο τιμές ενέργείας είναι πολύ κοντά στη τιμή 5,1(5,0824) 
%ακριβώς ίδιες.

%Ουσιαστικά προκύπτει ότι η ισχύς του σήματος x[n] για χρονικό διάστημα ίσο
%με μία περίοδο είναι ίσο με το άθροισμα των τιμών του  μέτρου του
%Διακριτού Μετασχηματισμού Fourier του σήματος x[n]  X[k] υψωμένες στο τετράγωνο, για
%κάθε αριθμό δείγματος k.




