%201500127 Δημήτρης Ορεινός ’σκηση 3.4
%Αρχικά ορίζουμε το σήμα συνεχούς χρόνου x(t) που μας δίνεται από την εκφωνηση της άσκησης,
%Πιο συγκεκριμένα το σήμα x[n] ορίζεται ως εξής:
%x(t)=cos(2*π*100*t)+cos(2*π*500*t), με το  χρόνο t(ως διάνυσμα χρόνου) να ορίζεται στο χρονικό διάστημα 
%[0,N-1]*Ts, όπου Ts η περίοδος δειγματοληψίας και τη συχνότητα (ως διάνυσμα συχνοτήτων) να ορίζεται 
%στο συχνοτικό διάστημα [0,N-1]*df, df=fs/N, όπου fs=2^(12) η συχνότητα δειγματοληψίας και 
%Ν ο αριθμός των δειγμάτων του σήματος, με Ν=2^(20).


clc
clear all


N=2^(20);

fs=2^12;

df=fs/N;

Ts=1/fs;

t=[0:N-1]*Ts;

f=[0:N-1]*df;


x=cos(2*pi*100*t)+cos(2*pi*500*t);




X1=fft(x)/N; %Υπολογίζουμε τον FFT του σήματος,χρησιμοποιώντας την εντολή fft(x) που αντιστοιχεί 
%στον υπολογισμό του Γρήγορου Μετασχηματισμού Fourier(FFT), 
%όπου x το σήμα όπου θα εφαρμόσουμε τον μετασχηματισμό αυτόν(το διάνυσμα όπου θα εφαρμοστεί αυτή τη εντολή), 
%που εδώ είναι το συνεχές σήμα x(t).
%Έπειτα πολλαπλασιάζουμε με 1/Ν, κάνοντας κανονικοποίηση ουσιαστικά, 
%για να πάρουμε σωστά αποτελέσματα.



y1=fftshift(X1);%Για να «κεντράρουμε» και τον FFT του σήματος x(t) στο μηδέν. 
%Αυτό γίνεται με χρήση της εντολής fftshift(Χ),όπου όπου Χ το σήμα όπου θα εφαρμόσουμε τον μετασχηματισμό αυτόν
%(το διάνυσμα όπου θα εφαρμοστεί αυτή τη εντολή), 
%που εδώ είναι ο Γρήγορος Μετασχηματισμός Fourier (FFT) του διακριτού
%σήματος x(t).
 


y2=abs(y1);

f1=[-N/2:N/2-1]*df;

%Έπειτα μέσω της εντολής figure ανίογουμε ένα νέο παράθυρο σχεδίασης. 

figure


subplot(3,1,1)






plot(f1,y2)%Σχεδιάζουμε τον "κεντραρισμένο" μετασχηματισμό Fourier(FFT) του σήματος x(t), 
%X[(j*2*π*f)], για συχνότητα δειγματοληψίας fs=2^(12) και 
% αριθμός  δειγμάτων N=2^(20)  χρησιμοποιώντας την εντολή plot(x,y),
%όπου σαν ανεξάρτητη μεταβλητή x,θα θεωρήσουμε τη συχνότητα f(το
%"κεντραρισμένο" διάστημα συχνοτήτων)
%και σαν εξαρτημένη μεταβλητή y, τις τιμές του 
%Μετασχηματισμού Fourier του σήματος x(t) X[(j*2*π*f)], 
%για κάθε τιμή του χρόνου t(διάνυσμα χρόνου).

%Τελικά από το γράφημα του "κεντραρισμένου" μετασχηματισμού Fourier(FFT)
%του σήματος x(t) και από την εντολή fft(x), προκύπτει ότι o
%Μετασχηματισμός Fourier του σήματος x(t) είναι το άθροισμα των εξής
%συναρτήσεων δέλτα Χ(j*Ω)=0,5*(δ(f-100)+δ(f+100)+δ(f-500)+δ(f+500)),όπου για
%|f|=100Hz και |f|=500Hz(στον θετικό και τον αρνητικό ημιάξονα), θα έχει τη
%μέγιστη τιμή της, για όλες τις άλλες συχνότητες f(σε θετικό και αρνητικό
%ημιάξονα)  η Χ(j*Ω) θα ισούται με μηδέν.

grid


ylabel('Χ(j*2*π*f)'), xlabel('f'), legend('Χ(j*2*π*f)'), title('Χ(j*2*π*f), fs=2^12')
%Με τη χρήση των εντολών ylabel('text')
%, xlabel('text'), legend('text'), title('text'), 
%εισάγουμε κατάλληλους τίτλους αξόνων και γραφήματος, λεζάντα, πλέγμα και
%βαθμολόγηση αξόνων για τo γράφημα του μέτρου του "κεντραρισμένου"
%Μετασχηματισμού Fourier FFT, για συχνότητα δειγματοληψίας fs=2^(12).

%Για να προκύψουν καλύτερα και πιο σωστά αποτελέσματα θα πρέπει να ορίσουμε
%τη συχνότητα δειγματοληψίας fs, αλλά και τον αριθμό των δειγμάτων N σε
%δυνάμεις του 2, όσο γίνεται μεγαλύτερες και πιο συγκεκριμένα για τη
%συχνότητα δειγματοληψίας fs να είναι πολύ πιο πάνω από το όριο της
%τιμής της f=2*500Hz=1000Hz(Για το σήμα x(t) f1=100Hz και f2=500Hz, άρα
%fs=500Hz).

%Επειδή θέλουμε να αυξάνουμε ή να μειώνουμε είτε τη συχνότητα δειγματοληψίας
%fs είτε τον  αριθμό δειγμάτων Ν , σε κάθε περίπτωση των μεταβολών ενός εκ 
%των fs,N θα πρέπει να ορίζουμε ξανά κάθε φορά το σήμα
%x(t)=cos(2*π*100*t)+cos(2*π*500*t),αλλάζοντας  κατάλληλα το περιεχόμενο
%του διανυσμάτος χρόνου t=[0,N-1]*Ts και του διανύσματος συχνότητας
%[0,N-1]*df.

%Επίσης η διαδικασία που εφαρμόσαμε για τον υπολογισμό του "κεντραρισμένου"
%FFT του σήματος x(t), θα ισχύει ακριβώς η ίδια και στις περιπτώσεις
%αύξησης ή μείωσης  είτε της συχνότητας δειγματοληψίας fs είτε του αριθμού
%των δειγμάτων N.

%Εδώ αναφερόμαστε στη περίπτωση που μεταβάλλουμε την συχνότητα δειγματοληψίας
%fs είτε όταν την αυξάνουμε είτε όταν τη μειώνουμε.


fs=2^10;
Ts=1/fs;
df=fs/N;
t=[0:N-1]*Ts;
f=[0:N-1]*df;
x=cos(2*pi*100*t)+cos(2*pi*500*t);

X1=fft(x)/N;

z1=fftshift(X1);

z2=abs(z1);



f2=[-N/2:N/2-1]*df;

subplot(3,1,2)

plot(f2,z2);%Σχεδιάζουμε το μέτρο του "κεντραρισμένου" μετασχηματισμού Fourier(FFT) του σήματος x(t), 
%X[(j*2*π*f)], για συχνότητα δειγματοληψίας fs=2^(10) και 
% αριθμός  δειγμάτων N=2^(20) χρησιμοποιώντας την εντολή plot(x,y),
%όπου σαν ανεξάρτητη μεταβλητή x,θα θεωρήσουμε τη συχνότητα f(το
%"κεντραρισμένο" διάστημα συχνοτήτων)
%και σαν εξαρτημένη μεταβλητή y, τις τιμές του 
%Μετασχηματισμού Fourier του σήματος x(t) X[(j*2*π*f)], 
%για κάθε τιμή του χρόνου t(διάνυσμα χρόνου).

xlabel('f'), ylabel('Χ(j*2*π*f)'), legend('Χ(j*2*π*f)'), title('Χ(j*2*π*f), fs=2^10')
%Με τη χρήση των εντολών ylabel('text')
%, xlabel('text'), legend('text'), title('text'), 
%εισάγουμε κατάλληλους τίτλους αξόνων και γραφήματος, λεζάντα, πλέγμα και
%βαθμολόγηση αξόνων για τo γράφημα του μέτρου του "κεντραρισμένου"
%Μετασχηματισμού Fourier FFT, για συχνότητα δειγματοληψίας fs=2^(10).

grid


fs=2^16;

Ts=1/fs;
df=fs/N;
t=[0:N-1]*Ts;
f=[0:N-1]*df;
x=cos(2*pi*100*t)+cos(2*pi*500*t);

X1=fft(x)/N;


z1=fftshift(X1);

z2=abs(z1);



f3=[-N/2:N/2-1]*df;

subplot(3,1,3)

plot(f3,z2);%Σχεδιάζουμε τον "κεντραρισμένο" μετασχηματισμό Fourier(FFT) του σήματος x(t), 
%X[(j*2*π*f)], για συχνότητα δειγματοληψίας fs=2^(16) και 
% αριθμός  δειγμάτων N=2^(20) χρησιμοποιώντας την εντολή plot(x,y),
%όπου σαν ανεξάρτητη μεταβλητή x,θα θεωρήσουμε τη συχνότητα f(το
%"κεντραρισμένο" διάστημα συχνοτήτων)
%και σαν εξαρτημένη μεταβλητή y, τις τιμές του 
%Μετασχηματισμού Fourier του σήματος x(t) X[(j*2*π*f)], 
%για κάθε τιμή του χρόνου t(διάνυσμα χρόνου).

xlabel('f'); ylabel('Χ(j*2*π*f)'); legend('Χ(j*2*π*f)'); title('Χ(j*2*π*f), fs=2^16')
%Με τη χρήση των εντολών ylabel('text')
%, xlabel('text'), legend('text'), title('text'), 
%εισάγουμε κατάλληλους τίτλους αξόνων και γραφήματος, λεζάντα, πλέγμα και
%βαθμολόγηση αξόνων για τo γράφημα του μέτρου του "κεντραρισμένου"
%Μετασχηματισμού Fourier FFT, για συχνότητα δειγματοληψίας fs=2^(16).


grid

%Συμπεραίνουμε μέσω του γραφήματος του "κεντραρισμένου" Μετασχημτισμού
%Fourier(FFT που είναι ο Γρήγορος Μετασχηματισμός Fourier) σε συνάρτηση με τη συχνότητα f( κεντραρισμένο διάνυσμα
%συχνοτήτων),πώς με ίδιο αριθμό δειγμάτων N=2^(20) όταν αυξάνουμε τη συχνότητα δειγματοληψίας fs παίρνουμε
%τον ίδιο αριθμό συχνοτικών συνιστωσών για τον αντίστοιχα ίδιο αριθμό
%δειγμάτων Ν, αλλά θα έχουμε ένα  φάσμα συχνοτήτων που επεκετείνεται
%σε περισσότερες τιμές συχνοτήτων f και αυτές
%οι συνιστώσες φαίνονται να τις έχουμε λάβει πολύ πιο "πυκνά".Το φαινόμενο
%των "πυκνότερων" φασματικών συνιστωσών θα είναι εντονότερο όσο περισσότερο
%αυξάνουμε τη συχνότητα δειγματοληψίας fs(ακόμα και όταν η συχνότητα δειγματοληψίας fs  αυξηθεί πολύ πιο πάνω από 
%τη τιμή συχνότητας δειγματοληψίας fs=2^(12)).

%Επίσης  όταν μειώνουμε τη συχνότητα δειγματοληψίας fs παίρνουμε
%τον ίδιο αριθμό συχνοτικών συνιστωσών για τον αντίστοιχα ίδιο αριθμό
%δειγμάτων Ν, αλλά θα έχουμε ένα πιο φάσμα συχνοτήτων που επεκετείνεται σε 
%λιγότερες τιμές συχνοτήτων f και αυτές
%οι συνιστώσες φαίνονται να τις έχουμε λάβει πολύ πιο "αραιά".Παρατηρούμε
%επίσης ότι όσο περισσότερο μειώνουμε τη υχνότητα δειγματοληψίας fs, τότε
%θα έχουμε ολοένα και αυξημένη επικάλυψη μεταξύ των φασματικών συνιστωσών,
%όποτε το σήμα μας δε θα αναπαρίσταται με τον καλύτερο και τον πιο
%ακριβέστερο τρόπο.(Η επικάλυψη γίνεται μεγαλύτερη, όταν η συχνότητα δειγματοληψίας fs  μειωθεί πολύ 
%περισσότερο από τη τιμή συχνότητας δειγματοληψίας fs=2^(12)).



%Έπειτα αναφερόμαστε στη περίπτωση που μεταβάλλουμε τον αριθμό δειγμάτων
%Ν είτε όταν τον αυξάνουμε είτε όταν τον μειώνουμε.



figure%Έπειτα μέσω της εντολής figure ανίογουμε ένα νέο παράθυρο σχεδίασης.

N=2^26;
fs=2^12;
Ts=1/fs;
df=fs/N;
t=[0:N-1]*Ts;
f=[0:N-1]*df;
x=cos(2*pi*100*t)+cos(2*pi*500*t);

y1=fft(x);
z1=fftshift(y1);

h1=abs(z1/N);

f1=[-N/2:N/2-1]*df;

subplot(2,1,1)

plot(f1,h1);
xlabel('f'),ylabel('Χ(j*2*π*f)'),legend('FFT'),title('FFT shifted fs=2^12, N=2^26')%Με τη χρήση των εντολών ylabel('text')
%, xlabel('text'), legend('text'), title('text'), 
%εισάγουμε κατάλληλους τίτλους αξόνων και γραφήματος, λεζάντα, πλέγμα και
%βαθμολόγηση αξόνων για τo γράφημα του μέτρου του "κεντραρισμένου"
%Μετασχηματισμού Fourier FFT, για αριθμό δειγμάτων Ν=2^(26).


grid


N=2^11;
fs=2^12;
Ts=1/fs;
df=fs/N;
t=[0:N-1]*Ts;
f=[0:N-1]*df;
x=cos(2*pi*100*t)+cos(2*pi*500*t);

y2=fft(x)/N;
z2=fftshift(y2);

h2=abs(z2);

f2=[-N/2:N/2-1]*df;

subplot(2,1,2)

plot(f2,h2);
xlabel('f'),ylabel('Χ(j*2*π*f)'),legend('FFT'),title('FFT shifted fs=2^12, N=2^11')
%Με τη χρήση των εντολών ylabel('text')
%, xlabel('text'), legend('text'), title('text'), 
%εισάγουμε κατάλληλους τίτλους αξόνων και γραφήματος, λεζάντα, πλέγμα και
%βαθμολόγηση αξόνων για τo γράφημα του μέτρου του "κεντραρισμένου"
%Μετασχηματισμού Fourier FFT, για αριθμό δειγμάτων Ν=2^(11).

grid

%Συμπεραίνουμε μέσω του γραφήματος του "κεντραρισμένου" Μετασχημτισμού
%Fourier(FFT που είναι ο Γρήγορος Μετασχηματισμός Fourier) σε συνάρτηση με τη συχνότητα f(κεντραρισμένο διάνυσμα
%συχνοτήτων), με ίδια συχνότητα δειγματοληψίας fs=2^(12)που σημαίνει ότι το
%φάσμα μας θα εκτείνεται στον ίδιο αριθμό 
%τιμών συχνότητας f, ότι όταν
%αυξάνουμε τον αριθμό των δειγμάτων Ν, θα έχουμε μεγαλύτερη ακρίβεια στην
%αναπαράσταση του σήματος, ενώ αν
%μειώσουμε τον αριθμό των δειγμάτων Ν, θα έχουμε μικρότερη ακρίβεια  στην
%αναπαράσταση του σήματος(Θα αρχίσει να υπάρχει μεγαλύτερη επικάλυψη μεταξύ των δειγμάτων ,όταν ο αριθμός των 
%δειγμάτων  μειωθεί πολύ περισσότερο από τη τιμή  Ν=2^(20)).





