%201500127 Δημήτρης Ορεινός Άσκηση 3.1


%Αρχικά ορίζουμε το σήμα διακριτού χρόνου x[n] που μας δίνεται από την εκφωνηση της άσκησης,
% ορίζοντας σταθερό χρονικό βήμα time_step=1, μιας και μιλάμε για διακριτό σήμα. 
%Πιο συγκεκριμένα το σήμα x[n] ορίζεται ως εξής:
%x[n]=(0,9)^(n), με το  χρόνο n(ως διάνυσμα χρόνου) να ορίζεται στο χρονικό διάστημα [0,N-1], όπου
%Ν=2^(4)=16.

clc
clear all

 N=2^(4);


n=[0:N-1];


x=(0.9).^(n);






%Έπειτα μέσω της εντολής figure ανίογουμε ένα νέο παράθυρο σχεδίασης. 

figure

subplot(3,1,1)%Με τη χρήση  της εντολής subplot(m,n,p), (όπου ο τελευταίος δείκτης p
%ορίζει ποιο παράθυρο κάθε φορά είναι ανοιχτό),χωρίζουμε το παράθυρο σχεδίασης σε τρία μέρη. 


 
 stem(n,x)%Σχεδιάζουμε στο πρώτο παράθυρο το σήμα x[n],χρησιμοποιώντας την εντολή stem(x,y),
%όπου σαν ανεξάρτητη μεταβλητή x,θα θεωρήσουμε το χρόνο n και σαν
%εξαρτημένη μεταβλητή y, τις τιμές του σήματος x[n], για κάθε τιμή του
%χρόνου n.
 
grid  

ylabel('x[n]'), xlabel('n'), legend('x[n]'), title('x[n]')%Με τη χρήση των εντολών ylabel('text')
%, xlabel('text'), legend('text'), title('text'), 
%εισάγουμε κατάλληλους τίτλους αξόνων και γραφήματος, λεζάντα, πλέγμα και
%βαθμολόγηση αξόνων για τo γράφημα του σήματος x[n].


k=[0:N-1];%Όρίζουμε το διάνυσμα των δειγμάτων k, για το οποίο  k ισχύει ότι: 
%Έστω ότι δειγματοληπτούμε τη μία περίοδο ,για συχνότητες ω που ανήκουν στο
%διάστημα [0,2*π], του Μετασχηματισμού Fourier  διακριτού χρόνου (DTFT) του σήματος, 
%έτσι ώστε να πάρουμε N δείγματα συχνότητας.
%Άρα ωk=2*π/Ν=δω, όπου k είναι ο αριθμός του δείγματος ,ωk είναι η (κυκλική) συχνότητα στο
%δείγμα αυτό και δω η απόσταση μεταξύ των διαδοχικών δειγμάτων που
%παίρνουμε σε αυτή τη δειγματοληψία.

%Ύστερα υπολογίζουμε το Διακριτό Μετασχηματισμό Fourier (DFT)του διακριτού σήματος x[n],δηλαδή
%την προβολή των Ν δειγμάτων x(n) σε Ν διακριτές συχνότητες, οι οποίες βρίσκονται στο διάστημα μιας περιόδου 
%του Μετασχηματισμού Fourier  διακριτού χρόνου (DTFT)
%μέσω της πρώτης από τις δύο γνωστές σχέσεις (3.2) στη σελίδα 22 του εργαστηριακού οδηγού.Το
%άθροισμα το οποίο μας δίνει αυτή τη γνωστή σχέση το υπολογίζουμε με τη
%βοήθεια μίας forloop και έτσι επιτυγχάνουμε σε κάθε loop, 
%για  συγκεκριμένο  αριθμό  δειγμάτος k κάθε φορά, να αθροίζουμε ως προς τον χρόνο
%n(δηλαδή για κάθε τιμή του χρονικού διανύσματος n, στη προκειμένη
%περίπτωση) το x[n].


X=0;
t=0;
for r=0:N-1
    
    
    t=t+1;
    X=X+x(t).*exp(-j*r*(2*pi)/N*k);
    

end







subplot(3,1,2)

stem(k,abs(X))%Σχεδιάζουμε στο δεύτερο παράθυρο τον Διακριτό Μετασχηματισμό Fourier(DFT) του σήματος x[n] X[k],
%χρησιμοποιώντας την εντολή stem(x,y), όπου σαν ανεξάρτητη μεταβλητή x,θα θεωρήσουμε τους δείκτες k και σαν
%εξαρτημένη μεταβλητή y, τις τιμές του μέτρου του διακριτού Μετασχηματισμού Fourier(DFT) του σήματος x[n] X[k], 
%για κάθε αριθμό των δειγμάτων (διανύσματος δειγμάτων k1)k.

%Στη παραπάνω γραφική παράσταση, στον κατακόρυφο άξονά της χρησιμοποιήσαμε
%το μέτρο του Διακριτού Μετασχηματισμού Fourier(DFT), δίοτι το άθροισμα(η
%σειρά) που δίνει τον DFT συγκλίνει σε μιγαδικό όρο, όποτε με μιγαδικούς
%αριθμούς δε θα προέκυπτε ότι αναμέναμε.



grid

ylabel('X[k]'), xlabel('k'), legend('X[k]'), title('X[k]')
%Με τη χρήση των εντολών ylabel('text')
%, xlabel('text'), legend('text'), title('text'), 
%εισάγουμε κατάλληλους τίτλους αξόνων και γραφήματος, λεζάντα, πλέγμα και
%βαθμολόγηση αξόνων για τo γράφημα του διακριτού Μετασχηματισμού Fourier(DFT) του σήματος x[n] X[k].


%Ύστερα υπολογίζουμε τον Αντίστροφο Διακριτό Μετασχηματισμό Fourier (IDFT)του διακριτού σήματος x[n] 
%μέσω της δεύτερης από τις δύο γνωστές σχέσεις (3.2) στη σελίδα 22 του εργαστηριακού οδηγού.Το
%άθροισμα το οποίο μας δίνει αυτή τη γνωστή σχέση το υπολογίζουμε με τη
%βοήθεια μίας forloop και έτσι επιτυγχάνουμε σε κάθε loop, 
%για μία συγκεκριμένη τιμή του χρόνου(στη προκειμένη περίπτωση του χρονικού διανύσματος) n κάθε φορά, 
%να αθροίζουμε ως προς τον αριθμό των δειγμάτων k
%περίπτωση) το Διακριτό Μετασχηματισμό Fourier X[k].


x1=0;
h=0;
for t=0:N-1
    
    
    h=h+1;
    x1=x1+(1/N)*X(h).*exp(j*t*(2*pi)/N*k);
    

end







subplot(3,1,3)

stem(k,abs(x1))%Σχεδιάζουμε στο τρίτο παράθυρο τον αντίστροφο διακριτό Μετασχηματισμού Fourier(DFT) 
%του σήματος x[n] X[k], χρησιμοποιώντας την εντολή stem(x,y), όπου σαν ανεξάρτητη μεταβλητή x,θα 
%θεωρήσουμε τους δείκτες k και σαν εξαρτημένη μεταβλητή y, τις τιμές του μέτρου του 
%Αντιστρόφου Διακριτού Μετασχηματισμού Fourier(IDFT)
%(η αντίστοιχη σειρά του IDFT συγκλίνει σε πραγματικές τιμές) του σήματος x[n] , 
%για κάθε τον αριθμό των δειγμάτων (διανύσματος δειγμάτων k1)k.

grid

ylabel('xrec[k]'), xlabel('k'), legend('xrec[k]'), title('xrec[k]')
%Με τη χρήση των εντολών ylabel('text')
%, xlabel('text'), legend('text'), title('text'), 
%εισάγουμε κατάλληλους τίτλους αξόνων και γραφήματος, λεζάντα, πλέγμα και
%βαθμολόγηση αξόνων για τo γράφημα του αντίστροφου διακριτου Μετασχηματισμού Fourier(IDFT) του σήματος x[n],
%μέσω του οποίου προκύπτει το αρχικό σήμα x[n] ανακατασκευασμένο.








%Ένα πολύ σημαντικό συμπέρασμα αποτελεί και το ότι ο διακριτός Μετασχηματισμός Fourier (DFT) μίας πεπερασμένης
%ακολουθίας αριθμών, στο παράδειγμά μας, αλλά και γενικότερα
%του διακριτού σήματος x[n],Χ[k] αποτελεί ουσιαστικά μία περιοδική ακολουθία, 
%διότι για κάθε k, όπου ο αριθμός των δειγμάτων k  ανήκει στο διάστημα [0,N-1], ισχύει ότι X[k]=X[k+N], N=2^4.
%Αυτό μπορεί να επιβεβαιωθεί για κάθε n, παίρνοντας τη σχέση X[k]= (1-0,9^N)/(  1-0,9*e^(-j*k*2*π/Ν) ) , 
%και με τη χρήση της matlab, τη βάλουμε σε μία forloop για τιμές k από 0 έως 2*Ν-1, τότε θα προκύψουν τα παρακάτω:
%X[0]=X[16]= 8,1470
%X[1]=X[17]= 0,9338 - 1,9086*i
%X[2]=X[18]= 0,5514 - 0,9651*i
%X[3]=X[19]= 0,4764 - 0,6042*i
%X[4]=X[20]= 0,4501 - 0,4051*i
%X[5]=X[21]= 0,4383 - 0,2711*i
%X[6]=X[22]= 0,4325 - 0,1682*i
%X[7]=X[23]= 0,4296 – 0,0808*i
%X[8]=X[24]= 0,4288 - 0,0000*i
%X[9]=X[25]= 0,4296 + 0,0808*i
%X[10]=X[26]= 0,4325 + 0,1682*i
%X[11]=X[27]= 0,4383+0,2711*i
%X[12]=X[28]= 0,4501+0,4051*i
%X[13]=X[29]= 0,4764+0,6042*i
%X[14]=X[30]= 0,5514+0,9651*i
%X[15]=X[31]= 0,9338+1,9086*i






