%201500127 Δημήτρης Ορεινός ’σκηση 4.3

clc
clear all

%Αρχικά ορίζουμε το σήμα πληροφορίας m(t),χρησιμοποιώντας τη τεχνική των πολύκλαδων συναρτήσεων,
%όπου ορίζουμε τα κατάλληλα κάθε φορά διανύσματα χρόνου, όλα με σταθερό χρονικό βήμα ts=0,001sec. %
%Το σήμα m(t)ορίζεται ως εξής:m(t)=1 ,για t που ανήκει στο χρονικό διάστημα(ορισμένο ως 
%χρονικό διάνυσμα t1) [0,t0/3],m(t)=-2 ,για t που ανήκει στο χρονικό διάστημα(ορισμένο ως 
%χρονικό διάνυσμα t2) (t0/3,2*t0/3],m(t)=0 ,για t που ανήκει στο χρονικό διάστημα(ορισμένο ως 
%χρονικό διάνυσμα t3) (2*t0/3,t0],
%Ορίζουμε ως σταθερές του προβλήματος τη χρονική σταθερά t0=0,15sec, το 
%χρονικό βήμα(Περίοδος Δειγματοληψίας)ts=0,001sec, τη συχνότητα
%δειγματοληψίας fs=1/ts, το συχνοτικό βήμα df=0,3Hz
%και τη συχνότητα του φορέα fc=250Ηz. Ταυτόχρονα ορίζουμε  και το σήμα του
%φορέα, όπου c(t) =Αc*cos(2*π*fc*t), με Αc=1, το πλάτος του φέροντος κύματος.


t0 = 0.15;
ts = 0.001;
fc = 250;

a=0.85;
snr = 10;
fs = 1/ts;
df = 0.3;

t1=[0:ts:t0/3];

t2=[(t0/3)+ts:ts:2*t0/3];

t3=[(2*t0/3)+ts:ts:t0];


t=[t1 t2 t3];%Ορίζουμε το χρόνο t σαν ένα διάνυσμα χρόνου που έχει προκύψει 
%από σύντμηση των τριών διανυσμάτων χρόνου t1, t2, t3.



m1=ones(1,length(t1));

m2=-2*ones(1,length(t2));

m3=zeros(1,length(t3));

m=[m1 m2 m3];%Κάνουμε σύντημση των διανυσμάτων τιμών του σήματος m(t) για να προκύψει το σήμα πληροφορίας m(t).


c = cos(2*pi*fc.*t);

x=1+a*m;

u1=x.*c;



figure(1);%Μέσω της εντολής figure ανοίγουμε ένα νέο παράθυρο σχεδίασης που το χωρίζουμε σε τρία μέρη.

subplot(3,1,1);

plot(t,m(1:length(t)));%Στο πρώτο παράθυρο σχεδιάζουμε τη γραφική παράσταση του σήματος m(t) 
%σε συνάρτηση με το χρόνο t,
%χρησιμοποιώντας την εντολή plot(x,y),
%όπου σαν ανεξάρτητη μεταβλητή x,θα θεωρήσουμε το χρόνο t(το
%διάνυσμα χρόνου t)και σαν εξαρτημένη μεταβλητή y, τις τιμές του 
%του σήματος m(t) ,για κάθε τιμή του χρόνου t(διάνυσμα χρόνου t).


grid

title('m(t)') , xlabel('t'), ylabel('m(t)'), legend('m(t)')%Με τη χρήση των εντολών ylabel('text')
%, xlabel('text'), legend('text'), title('text'), 
%εισάγουμε κατάλληλους τίτλους αξόνων και γραφήματος, λεζάντα, πλέγμα και
%βαθμολόγηση αξόνων για τo γράφημα  του σήματος πληροφορίας m(t).


subplot(3,1,2);

plot(t,c(1:length(t)));%Στο δεύτερο παράθυρο σχεδιάζουμε τη γραφική παράσταση του σήματος φορέα c(t) 
%σε συνάρτηση με το χρόνο t,
%χρησιμοποιώντας την εντολή plot(x,y),
%όπου σαν ανεξάρτητη μεταβλητή x,θα θεωρήσουμε το χρόνο t(το
%διάνυσμα χρόνου t)και σαν εξαρτημένη μεταβλητή y, τις τιμές του 
%του σήματος του φορέα c(t) , για κάθε τιμή του χρόνου t(διάνυσμα χρόνου t).

grid

title('c(t)') , xlabel('t'), ylabel('c(t)'), legend('c(t)')%Με τη χρήση των εντολών ylabel('text')
%, xlabel('text'), legend('text'), title('text'), 
%εισάγουμε κατάλληλους τίτλους αξόνων και γραφήματος, λεζάντα, πλέγμα και
%βαθμολόγηση αξόνων για τo γράφημα  του σήματος  φορέα c(t).

subplot(3,1,3);

plot(t,u1(1:length(t)));%Στο τρίτο παράθυρο σχεδιάζουμε τη γραφική παράσταση του διαμορφωμένου σήματος διπλής
%πλευρικής ζώνης uAM(t) 
%σε συνάρτηση με το χρόνο t,
%χρησιμοποιώντας την εντολή plot(x,y),
%όπου σαν ανεξάρτητη μεταβλητή x,θα θεωρήσουμε το χρόνο t(το
%διάνυσμα χρόνου t)και σαν εξαρτημένη μεταβλητή y, τις τιμές του 
%του σήματος uAM(t) , για κάθε τιμή του χρόνου t(διάνυσμα χρόνου t).


grid



title('uΑΜ(t)') , xlabel('t'), ylabel('uΑΜ(t)'), legend('uΑΜ(t)')%Με τη χρήση των εντολών ylabel('text')
%, xlabel('text'), legend('text'), title('text'), 
%εισάγουμε κατάλληλους τίτλους αξόνων και γραφήματος, λεζάντα, πλέγμα και
%βαθμολόγηση αξόνων για τo γράφημα του  διαμορφωμένου κατά πλάτος σήματος uΑΜ(t).

pause(0);

%Με τη χρήση της βοηθητικής συνάρτησης [M,m,df]=fftseq(m,ts,df) και
%παράλληλα από τον γνωστό ορισμό του μετασχηματισμού Fourier 
%για τα συνεχή σήματα, δηλαδή το ολοκλήρωμα από το 0 εώς το t0(Όλα τα
%σήματα m(t), c(t) και uAM(t) τα ορίσαμε στο διάστημα [0,t0]) γινομένου του εκάστοτε σήματος με
%τον εκθετικό όρο e^(-j*2*π*f*t).
%υπολογίζουμε αναλυτικά,αλλά και μέσω των παρακάτω γραμμών κώδικα τους μετασχηματισμούς
%Fourier των σημάτων m(t), c(t) και UDSB(t).Τελικά θα προκύψει το ίδιο
%αποτέλεσμα και με τους δύο τρόπους για κάθε σήμα, δηλαδή: 

%M(j*2*π*f)=(t0/3)*e^(-j*π*f*t0/3)*sinc(t0*f/3)-2*(t0/3)*e^(-j*π*f*t0)*sinc(t0*f/3),
%όπου  για t0=0,15sec, θα έχουμε ότι
%Μ(j*2*π*f)=(0,05)*(1-2*e^(-0,1*π*f))*e^(-j*π*0,05*f)*sinc(0,05*f).

%Για συχνότητα φορέα fc=250Hz

%C(j*2*π*f)=0,5*(δ(f+250)+δ(f-250)), δηλαδή το άθροισμα δύο συναρτήσεων δέλτα που
%προσεγγίζονται από στενούς παλμούς,με τη συγκεκριμένη συνάρτηση, να
%"ακουμπάει"(δηλαδή να αρχίσει και να σταματήσει να παίρνει τιμές) τόσο η θετική, όσο και η
%αρνητική συχνοτική συνιστώσα της, στη συχνότητες |f|=200Hz και |f|=300Hz .
%Αυτή η συνάρτηση(θετική και αρνητική συχνοτική συνιστώσα) θα πάρει τη μέγιστη τιμή της 
%που είναι ίση με 0,5, για |fc|=250Hz.

%Ο τύπος UAM(j*2*π*f)=(Ac/2)*[α*M(f-fc)+α*M(f+fc)+δ(f-fc)+δ(f+fc)],υπάρχει στη σελίδα 31 
%του εργαστηριακού οδηγού. Τελικά προκύπτει
%UAM(j*2*π*f)=0,5*[δ(f-250)+δ(f+250)]+0,02125*[(1-2*e^(-0,1*π*(f-250)))*e^(-j*π*0,05*(f-250))*sinc(0,05*(f-250))+
%1-2*e^(-0,1*π*(f+250)))*e^(-j*π*0,05*(f+250))*sinc(0,05*(f+250))].

[M,m,df1]=fftseq(m,ts,df);


M = M/fs;

[U,u1,df1] = fftseq(u1,ts,df);

U = U/fs;


[C,c,df1] = fftseq(c,ts,df);

C=C/fs;

f = [0:df1:df1*(length(m)-1)]-fs/2;%Ορίζουμε κατάλληλο "κεντραρισμένο διάστημα συχνοτήτων στο 0, ώστε αργότερα 
%να σχεδιάσουμε τα φάσματα των σημάτων m(t),c(t) και uΑΜ(t)



figure(2);%Μέσω της εντολής figure ανοίγουμε ένα νέο παράθυρο σχεδίασης που το χωρίζουμε σε τρία μέρη





subplot(3,1,1);

plot(f,abs(fftshift(M)));%Στο πρώτο παράθυρο σχεδιάζουμε τη γραφική παράσταση του σήματος του φορέα
%c(t) σε συνάρτηση με τη συχνότητα f ,
%χρησιμοποιώντας την εντολή plot(x,y),
%όπου σαν ανεξάρτητη μεταβλητή x,θα θεωρήσουμε τη συχνότητα f("κεντραρισμένο" διάνυσμα συχνοτήτων f στο μηδέν)
%και σαν εξαρτημένη μεταβλητή y, τις τιμές του 
%του σήματος πληροφορίας m(t) ,για κάθε τιμή της συχνότητας f("κεντραρισμένο" διάνυσμα συχνοτήτων f στο μηδέν)


grid

title('M(j*2*π*f)') , xlabel('f'), ylabel('M(j*2*π*f)'), legend('M(j*2*π*f)')
%Με τη χρήση των εντολών ylabel('text')
%, xlabel('text'), legend('text'), title('text'), 
%εισάγουμε κατάλληλους τίτλους αξόνων και γραφήματος, λεζάντα, πλέγμα και
%βαθμολόγηση αξόνων για τo φάσμα του μέτρου του "κεντραρισμένου" στο μηδέν
%Μετασχηματισμού Fourier FFT του σήματος πληροφορίας m(t).

subplot(3,1,2);

plot(f,abs(fftshift(C)));

grid

title('C(j*2*π*f)') , xlabel('f'), ylabel('C(j*2*π*f)'), legend('C(j*2*π*f)')
%Με τη χρήση των εντολών ylabel('text')
%, xlabel('text'), legend('text'), title('text'), 
%εισάγουμε κατάλληλους τίτλους αξόνων και γραφήματος, λεζάντα, πλέγμα και
%βαθμολόγηση αξόνων για τo γράφημα του μέτρου του "κεντραρισμένου"
%Μετασχηματισμού Fourier FFT του σήματος του φορέα c(t).






subplot(3,1,3);


plot(f,abs(fftshift(U)));



title('UΑΜ(j*2*π*f)') , xlabel('f'), ylabel('UΑΜ(j*2*π*f)'), legend('UΑΜ(j*2*π*f)')
%Με τη χρήση των εντολών ylabel('text')
%,xlabel('text'), legend('text'), title('text'), 
%εισάγουμε κατάλληλους τίτλους αξόνων και γραφήματος, λεζάντα, πλέγμα και
%βαθμολόγηση αξόνων για τo φάσμα του διαμορφωμένου κατά πλάτος σήματος uAM(t).


grid


pause(0);

%Έπειτα υπολογίζουμε θεωρητικά την ισχύ του διαμορφωμένου  σήματος uAM(t), αν
%θεωρήσουμε ότι το  m(t) είναι περιοδικό με περίοδο Τ=t0.Ισχύει από τη
%θεωρία ότι Pu=Pm/2=0,83, όπου Pm=1,67 η μέση ισχύς του σήματος πληροφορίας
%m(t) που υπολογίζεται από το ολοκλήρωμα της συνάρτησης m(t)^2 στο χρόνο από 0 εώς 2*t0/3,
%διαιρούμενο με τη περίοδο του σήματος που είναι ίση με τη χρονική σταθερά
%t0.Έπειτα από τη σχέση PΑΜ=((Ac)^2)/2*[1+(a^2)*Pm+((2*α)/Τ)*mean(m(t))], όπου τελικά PAM=0,82 
%Επίσης η Pm μπορεί θεωρητικά να προκύψει και από τη σχέση
%PΑΜ=((Ac)^2)/2*[1+(a^2)*Pm+((2*α)/Τ)*mean(m(t))], όπου mean(m(t))=-α/3 και α=0,85, η
%μέση τιμή του σήματος m(t), δηλαδή το ολοκλήρωμα της συνάρτησης m(t) στο
%χρόνο από 0 εώς 2*t0/3, εφόσον υπολογίσουμε τη PAM μέσω της βοηθητικής
%συνάρτησης spower(x), 

%Αν υπολογίσουμε την ίδια ισχύ (PAM) με τη χρήση της βοηθητικής συνάρτησης που
%ορίσαμε παρακάτω, τότε διαπιστώνουμε πώς προέκυψε σχεδόν η ίδια ισχύς ίση
%με Pu=0,8360 με ελάχιστη απόκλιση από τη θεωρητική τιμή Pu που υπολογίσαμε
%παραπάνω.

%Επίσης η απόδοση του συστήματος, δηλαδή η σχέση: 
%n=(ωφέλιμη ισχύς(μέση ισχύς που μεταφέρει πληροφορία))/(συνολική ισχύς που
%εκπέμπεται από το
%σύστημα)=((α^2)*Pm+((2*α)/Τ)*mean(m(t)]*(Αc^2/2)/((Αc^2/2)*[1+α^2*Pm+((2*α)/Τ)*mean(m(t)),
%με τα θεωρητικά δεδομένα που προκύπτουν για τις τιμές έχουμε για τις ισχύς
%Pm και PAM, προκύπτει ότι n=0,3902.
%Με τα δεδομένα όμως που προκύπτουν από τον παρακάτω κώδικα,προκύπτει ότι
%n=0.4019, δηλαδή σχεδόν το ίδιο αποτέλεσμα με το θεωρητικό με ελάχιστη
%απόκλιση.
%Ουσιαστικά η τιμή της απόδοσης του συστήματος είναι αρκετά μακριά από τη
%μονάδα, αλλά ούτε και πολύ κοντά στο μηδέν, άρα η ισχύς του σήματος που
%δεν μεταφέρει πληροφορία είναι αισθητά, αλλά όχι πολύ μεγαλύτερη από την
%ισχύ που περιέχει το σήμα πληροφορίας m(t) και άρα το συγκεκριμένο σύστημα δεν είναι το
%πιο αποδοτικό όσον αφορά τη κατανάλωση ενέργειας.

%Έτσι με τη βοήθεια της απόδοσης και την ισχύ PR=PAM του διαμορφωμένου σήματος στο δέκτη  που υπολογίσαμε πριν, 
%υπολογίζουμε την ισχύ του θορύβουστον δέκτη PN με τη χρήση του λόγου σήματος 
%προς θόρυβο στον δέκτη SNR=log2(PR/PN)=n*PR/PN,όπου τελικά PN=0,082
%και χρησιμοποιούμε τη τιμή της ισχύος του θορύβου που βρήκαμε για να
%λάβουμε τη τετραγωνική της ρίζα και τη πολλαπλασιάζουμε με κάποια τυχαία κατανομή 
%για να δημιουργήσουμε τη συνάρτηση του θορύβου, που θα προστεθεί στην αρχική συνάρτηση 
%του διαμορφωμένου σήματος uDSB(t).Με ελάχιστη απόκλιση θα προκύψει το ίδιο
%αποτέλεσμα PN=0,0836 για το θόρυβο που προστίθεται στο διαμορφωμένο σήμα uDSB(t),αν
%θέσουμε ως ισχύ PR=0,8360, δηλαδή την ισχύ που υπολογίσαμε με τη χρήση της βοηθητικής
%συνάρτησης p=spower(x).


signal_power3=spower(u1(1:length(t)));

signal_power_m=(2*(signal_power3)+2*(a/3)-1)/(a^2);

k=signal_power_m/2;

n=((a^2)*(k)-a/3)/signal_power3;

snr_lin = 10^(snr/10);

noise_power = (n*signal_power_m)/snr_lin;


noise_std = sqrt(noise_power);


noise = noise_std*randn(1,length(u1));


[N,noise,df1]=fftseq(noise,ts,df);

r = u1 + noise;

[R,r,df1]=fftseq(r,ts,df);

R = R/fs;


figure(3);%Μέσω της εντολής figure ανοίγουμε ένα νέο παράθυρο σχεδίασης που το χωρίζουμε σε δύο μέρη.

subplot(2,1,1);

plot(t,noise(1:length(t)))%Στο πρώτο παράθυρο σχεδιάζουμε τη γραφική παράσταση του σήματος θορύβου  
%σε συνάρτηση με το χρόνο t,
%χρησιμοποιώντας την εντολή plot(x,y),
%όπου σαν ανεξάρτητη μεταβλητή x,θα θεωρήσουμε το χρόνο t(το
%διάνυσμα χρόνου t)και σαν εξαρτημένη μεταβλητή y, τις τιμές του 
%του σήματος θορύβου ,για κάθε τιμή του χρόνου t(διάνυσμα χρόνου t).


title('noise(t)') , xlabel('t'), ylabel('noise(t)'), legend('noise(t)')%Με τη χρήση των εντολών ylabel('text')
%, xlabel('text'), legend('text'), title('text'), 
%εισάγουμε κατάλληλους τίτλους αξόνων και γραφήματος, λεζάντα, πλέγμα και
%βαθμολόγηση αξόνων για τo γράφημα  του σήματος  θορύβου.

grid


subplot(2,1,2);

plot(t,r(1:length(t))); %Στο δεύτερο παράθυρο σχεδιάζουμε τη γραφική παράσταση του διαμορφωμένου σήματος 
%κατά πλάτος(ΑΜ) που του 
%έχει προστεθεί θορύβος σε συνάρτηση με το χρόνο t,
%χρησιμοποιώντας την εντολή plot(x,y),
%όπου σαν ανεξάρτητη μεταβλητή x,θα θεωρήσουμε το χρόνο t(το
%διάνυσμα χρόνου t)και σαν εξαρτημένη μεταβλητή y, τις τιμές του 
%του σήματος uΑΜ(t) που του έχει προστεθεί θορύβος ,για κάθε τιμή του χρόνου t(διάνυσμα χρόνου t).


grid

title('r(t)') , xlabel('t'), ylabel('r(t)'), legend('r(t)')%Με τη χρήση των εντολών ylabel('text')
%, xlabel('text'), legend('text'), title('text'), 
%εισάγουμε κατάλληλους τίτλους αξόνων και γραφήματος, λεζάντα, πλέγμα και
%βαθμολόγηση αξόνων για τo γράφημα του σήματος r(t) που προκύπτει από το άθροισμα του αρχικού 
%διαμορφωμένου uAM(t) και του θορύβου που υπολογίσαμε προηγουμένως.



pause(0);


figure(4);%Μέσω της εντολής figure ανοίγουμε ένα νέο παράθυρο σχεδίασης που το χωρίζουμε σε δύο μέρη.


subplot(2,1,1);

plot(f,abs(fftshift(U)));%Στο πρώτο παράθυρο σχεδιάζουμε τη γραφική παράσταση του διαμορφωμένου σήματος 
%κατά διαμόρφωση διπλής πλευρικής ζώνης(DSB)
%σε συνάρτηση με τη συχνότητα f ,
%χρησιμοποιώντας την εντολή plot(x,y),
%όπου σαν ανεξάρτητη μεταβλητή x,θα θεωρήσουμε τη συχνότητα f("κεντραρισμένο" διάνυσμα συχνοτήτων f στο μηδέν)
%και σαν εξαρτημένη μεταβλητή y, τις τιμές του μέτρου του "κεντραρισμένου" στο μηδέν
%Μετασχηματισμού Fourier FFT 
%του σήματος uAM(t) ,για κάθε τιμή της συχνότητας f("κεντραρισμένο"
%διάνυσμα συχνοτήτων f στο μηδέν).

grid


title('UΑΜ(j*2*π*f)') , xlabel('f'), ylabel('UΑΜ(j*2*π*f)'), legend('UΑΜ(j*2*π*f)')
%Με τη χρήση των εντολών ylabel('text')
%,xlabel('text'), legend('text'), title('text'), 
%εισάγουμε κατάλληλους τίτλους αξόνων και γραφήματος, λεζάντα, πλέγμα και
%βαθμολόγηση αξόνων για τo φάσμα του διαμορφωμένου κατά πλάτος σήματος uΑΜ(t).





subplot(2,1,2);



plot(f,abs(fftshift(R)));
%Στο δεύτερο παράθυρο σχεδιάζουμε τη γραφική παράσταση του σήματος r(t)που προκύπτει από το
%άθροισμα του διαμορφωμένου σήματος 
%κατά πλάτος (ΑΜ) και του σήματος θορύβου που
%υπολογίσαμε σε συνάρτηση με τη συχνότητα f ,χρησιμοποιώντας την εντολή plot(x,y),
%όπου σαν ανεξάρτητη μεταβλητή x,θα θεωρήσουμε τη συχνότητα f("κεντραρισμένο" διάνυσμα συχνοτήτων f στο μηδέν)
%και σαν εξαρτημένη μεταβλητή y, τις τιμές μέτρου του "κεντραρισμένου" στο μηδέν
%Μετασχηματισμού Fourier FFT του σήματος 
%του σήματος uΑΜ(t) ,για κάθε τιμή της συχνότητας f("κεντραρισμένο"
%διάνυσμα συχνοτήτων f στο μηδέν).


grid

title('R(j*2*π*f)') , xlabel('f'), ylabel('R(j*2*π*f)'), legend('R(j*2*π*f)')
%Με τη χρήση των εντολών ylabel('text')
%,xlabel('text'), legend('text'), title('text'), 
%εισάγουμε κατάλληλους τίτλους αξόνων και γραφήματος, λεζάντα, πλέγμα και
%βαθμολόγηση αξόνων για τo φάσμα του σήματος που αποτελεί άθροισμα του σήματος θορύβου που βρήκαμε
%προηγουμένως και του διαμορφωμένου κατά πλάτος uΑΜ(t).



pause(0);



%Εδώ δημιουργήσαμε τη βοηθητική συνάρτηση για τον υπολογισμό του
%Μετασχηματισμού Fourier του εκάστοτε συνεχούς σήματος που χρειάζεται.

function[M,m,df]=fftseq(m,ts,df)
fs=1/ts;

if(nargin==2)

    n1 = 0;

else
    
    n1 = fs/df;
end

n2 = length(m);


n = 2^(max(nextpow2(n1),nextpow2(n2)));


M = fft(m,n);


m = [m,zeros(1,n-n2)];


df = fs/n;

end



function p=spower(x)%Εδώ δημιουργήσαμε τη βοηθητική συνάρτηση για τον υπολογισμό της
%ισχύος του εκάστοτε συνεχούς σήματος που χρειάζεται.


p = (norm(x)^2)/length(x);

end
